{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "54592742",
    "original_query": "Explain the following topics and write a sample code for the same: 1. DAGs (Directed Acyclic Graphs) in python 2. SQL query to demonstrate right join 3. bash script to automate monitoring of disk space",
    "file_manifest": [],
    "created_at": "2025-08-07T18:52:22.227343",
    "status": "running",
    "output_chain": {
      "T001": {
        "data": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.mungingdata.com/python/dag-directed-acyclic-graph-networkx/', 'content': \"Building DAGs / Directed Acyclic Graphs with Python - MungingData Skip to content MungingData Building DAGs / Directed Acyclic Graphs with Python Initializing search MungingData Home Spatial Spatial Functions Functions ST_Touches PySpark PySpark Working with array columns Avoid periods in column names Chaining transforms Column to list Combining PySpark Arrays Add constant column Dictionary to columns exists and forall Filter Array Install Delta, Jupyter Poetry Dependency management Random array values Rename columns Select columns Testing PySpark Union DataFrames Broadcast variables Schema definition None and NULL Spark Session Apache Spark Apache Spark Convert CSV to Delta Lake Broadcast joins Broadcast maps Array methods Scala array columns Scala DataFrame transform Column equality Column methods Compacting Parquet files Building JARs with SBT DataFrame schema DataFrame summary and describe Datasets Dates and Times Dealing with null Deduplicating and collapsing Percentile and median Environment configuration Best books expr eval Enough Scala Function order dependencies Logistic regression Mill build tool MapType columns Optimizing data lakes Output one file Pushed filters Partition by Shading dependencies Practical introduction Publishing with jitpack Pyspark vs Scala Real Google Sheets Register functions Import packages Spark SQL functions Spark Session Speak Slack notifications Start and end of month Streaming Trigger Once Testing with utest Upgrading to Spark 3 Using the console Start and end of week expr eval Filter DataFrame Frameless Spark HyperLogLog Incremental extracts Intro to DataFrames Intro to SBT rlike Aggregations Compacting files DevRel DevRel Virtuous Content Cycle DevRel Driven Development Python Python Building DAGs Building DAGs Table of contents Simple example Shortest path Longest path Topological sorting Checking validity Directed graph that's not acyclic Graph that's neither directed nor acyclic Multiple roots Graphing a DAG Next steps How pyenv works Split CSV Writing Parquet Jupyter and poetry Pandas Pandas Adding category column Large data Read Delta Lake Read multiple CSVs Rename columns Unit testing Golang Golang CSV to Parquet DataFrames PyArrow PyArrow Writing Custom Metadata Parquet metadata Scala Scala Call Java with wrapper Filesystem operations Library best practices Maintenance nightmare Serde case classes Testing with munit Templates Scalatest Read and write JSON Java Java SDKMAN installation jenv Misc Misc Appending Executables Path Open source is a delight Spark and Athena Creating a ticketing system Creators making money Learn Emacs Self publishing programming books Investing in cheap real estate numpy Save to text Manage calendar invites Delta Lake Delta Lake Merge, update, upserts Compact small files Type 2 SCD Updating partitions Vacuum Schema enforcement Time travel sqlite sqlite Create database Python Write to Parquet file Dask Dask Compress CSVs Output single file Install with conda CSV to Parquet Read Delta Lake Table of contents Simple example Shortest path Longest path Topological sorting Checking validity Directed graph that's not acyclic Graph that's neither directed nor acyclic Multiple roots Graphing a DAG Next steps Building DAGs / Directed Acyclic Graphs with Python Directed Acyclic Graphs (DAGs) are a critical data structure for data science / data engineering workflows. DAGs are used extensively by popular projects like Apache Airflow and Apache Spark . This blog post will teach you how to build a DAG in Python with the networkx library and run important graph algorithms. Once you're comfortable with DAGs and see how easy they are to work with, you'll find all sorts of analyses that are good candidates for DAGs. DAGs are just as important as data structures like dictionaries and lists for a lot of analyses. Simple example Consider the following DAG: root, a, b, c, d, and e are referred to as nodes. The arrows that connect the nodes are called edges. A graph is a colle\", 'images': [], 'rank': 1}, {'url': 'https://www.datacamp.com/blog/what-is-a-dag', 'content': '[error] Timeout while extracting content', 'rank': 2}, {'url': 'https://stackoverflow.com/questions/54903222/implementing-a-dag-in-python', 'content': 'directed acyclic graphs - Implementing a DAG in python - Stack Overflow Skip to main content Stack Overflow About Products For Teams Stack Overflow for Teams Where developers & technologists share private knowledge with coworkers Advertising Reach devs & technologists worldwide about your product, service or employer brand Knowledge Solutions Data licensing offering for businesses to build and improve AI tools and models Labs The future of collective knowledge sharing About the company Visit the blog Loading current community Stack Overflow help chat Meta Stack Overflow your communities Sign up or log in to customize your list. more stack exchange communities company blog Log in Sign up The 2025 Developer Survey results are in. Explore insights into technology and tools, careers, community and more. View results . Home Questions AI Assist Labs Tags Challenges Chat Articles Users Companies Collectives Communities for your favorite technologies. Explore all Collectives Teams Ask questions, find answers and collaborate at work with Stack Overflow for Teams. Try Teams for free Explore Teams Teams Ask questions, find answers and collaborate at work with Stack Overflow for Teams. Explore Teams Collectives on Stack Overflow Find centralized, trusted content and collaborate around the technologies you use most. Learn more about Collectives Teams Q&A for work Connect and share knowledge within a single location that is structured and easy to search. Learn more about Teams Implementing a DAG in python Ask Question Asked 6 years, 5 months ago Modified 3 years ago Viewed 41k times 16 I am implementing a DAG in python. I am using a dictionary to implement the DAG. Each key represents a node in the graph. And the value associated with a key represents a set of nodes dependent on the node at that key. Is it necessary to use an orderedDict instead of a Dict for implementing the DAG. The orderedDict preserves the order of insertion of the keys. I am wondering why would one want to preserve the insertion order of nodes in the DAG when the value at each key represents a set of nodes dependent of the node at that corresponding key? python directed-acyclic-graphs Share Improve this question Follow asked Feb 27, 2019 at 10:25 Sharu Gupta Sharu Gupta 201 1 1 gold badge 2 2 silver badges 5 5 bronze badges 0 Add a comment | 3 Answers 3 Sorted by: Reset to default Highest score (default) Trending (recent votes count more) Date modified (newest first) Date created (oldest first) 22 graphlib is the module in the Python standard library for creating directed acyclic graphics. It was new in version 3.9. It seems a bit redundant to copy/paste an example from the documentation, but here\\'s a very short one: >>> graph = {\"D\": {\"B\", \"C\"}, \"C\": {\"A\"}, \"B\": {\"A\"}} >>> ts = TopologicalSorter(graph) >>> tuple(ts.static_order()) (\\'A\\', \\'C\\', \\'B\\', \\'D\\') For earlier versions of Python there is a backport: pip install graphlib_backport or put this in your requirements.txt file: graphlib_backport; python_version < \"3.9.0\" Share Improve this answer Follow edited Jul 22, 2022 at 9:52 answered Feb 4, 2022 at 10:31 Ian Goldby Ian Goldby 6,235 1 1 gold badge 50 50 silver badges 91 91 bronze badges Add a comment | 14 Suppose you have the following DAG: You could represent this DAG as a dictionary: graph = {   \\'root\\': [\\'a\\'],   \\'a\\': [\\'b\\', \\'e\\'],   \\'b\\': [\\'c\\', \\'d\\'],   \\'d\\': [\\'e\\']} You could also represent this DAG as an ordered dictionary, but that\\'d be unnecessary. The ordering of the key / value pairs does not matter. There\\'s a buggy / incomplete Python DAG library that uses ordered dictionaries , but that lib isn\\'t a good example to follow. networkx is the gold standard for Python DAGs (and other graphs). You can create a networkx directed graph with a list of tuples that represent the graph edges: import networkx as nx graph = nx.DiGraph() graph.add_edges_from([(\"root\", \"a\"), (\"a\", \"b\"), (\"a\", \"e\"), (\"b\", \"c\"), (\"b\", \"d\"), (\"d\", \"e\")]) See here for more information abo', 'images': [{'url': 'https://i.sstatic.net/qaIWj.png', 'alt_text': 'example DAG', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://www.baeldung.com/cs/dag-applications', 'content': '[error] Timeout while extracting content', 'rank': 4}, {'url': 'https://www.geeksforgeeks.org/dsa/introduction-to-directed-acyclic-graph/', 'content': 'Introduction to Directed Acyclic Graph - GeeksforGeeks Skip to content Home Saved Videos Courses Courses Data Structures and Algorithms DSA Tutorial Data Structures Tutorial Algorithms Tutorial Top 100 DSA Interview Questions DSA-Roadmap[Basic-to-Advanced] ML & Data Science Learn Python Data Science Tutorial Machine Learning Tutorial Deep Learning Tutorial NLP Tutorial Computer Vision Tutorial Web Development HTML Tutorial CSS Tutorial JavaScript Tutorial ReactJS Tutorial NodeJS Tutorial Languages C C++ Java R Tutorial Golang Interview Corner Company Interview Corner Experienced Interviews Internship Experiences Practice Company Questions Competitive Programming CS Subjects Operating Systems DBMS Computer Networks Software Engineering Software Testing Jobs Get Hired: Apply for Jobs Job-a-thon: Hiring Challenge Corporate Hiring Solutions Practice All DSA Problems Problem of the Day GFG SDE Sheet Beginner\\'s DSA Sheet Love Babbar Sheet Top 50 Array Problems Top 50 String Problems Top 50 DP Problems Top 50 Graph Problems Top 50 Tree Problems Contests World Cup Hack-A-Thon GFG Weekly Coding Contest Job-A-Thon: Hiring Challenge BiWizard School Contest All Contests and Events GBlog Puzzles What\\'s New ? Change Language DSA Course DSA Interview Problems on Graph Practice Graph MCQs on Graph Graph Tutorial Graph Representation Graph Properties Types of Graphs Graph Applications BFS on Graph DFS on Graph Graph VS Tree Transpose Graph Dijkstra\\'s Algorithm Minimum Spanning Tree Prims Algorithm Topological Sorting Floyd Warshall Algorithm Strongly Connected Components Advantages & Disadvantages Sign In Open In App Introduction to Directed Acyclic Graph Last Updated : 23 Jul, 2025 Suggest changes Share Like Article Like Report A Directed Acyclic Graph , often abbreviated as DAG , is a fundamental concept in graph theory. DAGs are used to show how things are related or depend on each other in a clear and organized way. In this article, we are going to learn about Directed Acyclic Graph , its properties, and application in real life. Directed Acyclic Graph What is Directed Acyclic Graph? A Directed Acyclic Graph (DAG) is a directed graph that does not contain any cycles. Below Graph represents a Directed Acyclic Graph (DAG): Direct Acyclic Graph Meaning of Directed Acyclic Graph: Directed Acyclic Graph has two important features: Directed Edge s: In Directed Acyclic Graph, each edge has a direction, meaning it goes from one vertex (node) to another. This direction signifies a one-way relationship or dependency between nodes. Acyclic: The term \" acyclic \" indicates that there are no cycles or closed loops within the graph. In other words, you cannot traverse a sequence of directed edges and return to the same node, following the edge directions. Formation of cycles is prohibited in DAG. Hence this characteristic is essential. Directed Acyclic Graph Properties of Directed Acyclic Graph DAG: Directed Acyclic Graph (DAG) has different properties that make them usable in graph problems. There are following properties of Directed Acyclic Graph (DAG): Reachability Relation: In DAG, we can determine if there is a reachability relation between two nodes. Node A is said to be reachable from node B if there exists a directed path that starts at node B and ends at node A. This implies that you can follow the direction of edges in the graph to get from B to A. Transitive Closure: The transitive closure of a directed graph is a new graph that represents all the direct and indirect relationships or connections between nodes in the original graph. In other words, it tells you which nodes can be reached from other nodes by following one or more directed edges. Transitive Closure of Directed Acyclic Graph Transitive Reduction: The transitive reduction of a directed graph is a new graph that retains only the essential, direct relationships between nodes, while removing any unnecessary indirect edges. In essence, it simplifies the graph by eliminating edges that', 'images': [{'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20231019170926/dag6-660x478.jpeg', 'alt_text': 'dag6-660x478', 'width': '660', 'height': '478', 'confidence': 0.8999999999999999}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20231019164716/Untitled-Diagram-(2).png', 'alt_text': 'Untitled-Diagram-(2)', 'width': '501', 'height': '226', 'confidence': 0.8999999999999999}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20231106151300/1-(2).jpg', 'alt_text': '1-(2)', 'width': '1000', 'height': '500', 'confidence': 0.7}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20231106151411/2-(1).jpg', 'alt_text': '2-(1)', 'width': '1000', 'height': '500', 'confidence': 0.7}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20231106155309/3-(1).jpg', 'alt_text': '3-(1)', 'width': '1000', 'height': '500', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://medium.com/@dataproducts/step-by-step-process-to-building-directed-acyclic-graphs-dags-with-airflow-1bb41e352d15', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://object-oriented-python.github.io/9_trees_and_directed_acyclic_graphs.html', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://deepwiki.com/PacktPublishing/Causal-Inference-and-Discovery-in-Python/2.3-graphical-models-and-dags', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "T003": {
        "sql_right_join": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.programiz.com/sql/right-join', 'content': 'SQL RIGHT JOIN (With Examples) Learn DSA the way it should be with step-by-step code visualization. Learn DSA with step-by-step code visualization. Try now! Sale ends in Learn DSA the way it should be with step-by-step code visualization. Learn DSA with step-by-step code visualization. Try now! Sale ends in Tutorials Examples Courses Try Programiz PRO Course Index Tutorials Courses Python JavaScript TypeScript SQL HTML CSS C C++ Java R Ruby RUST Golang Kotlin Swift C# DSA Become a certified SQL programmer. ENROLL Popular Tutorials SQL SELECT SQL INSERT INTO SQL UPDATE SQL JOIN SQL GROUP BY Start Learning SQL Created with over a decade of experience. Learn Practice Compete Learn Python Learn HTML Learn JavaScript Learn SQL Learn DSA Learn C Learn C++ Learn Java View all Courses on Python Basics Python Intermediate C++ Basics C++ Intermediate C++ OOP C Programming Java Basics Java Intermediate Java OOP View all Courses on Python Challenges JavaScript Challenges Java Challenges C++ Challenges C Challenges View all Challenges on Learn Practice Compete Certification Courses Created with over a decade of experience and thousands of feedback. Learn Python Learn HTML Learn JavaScript Learn SQL Learn DSA View all Courses on Learn C Learn C++ Learn Java Python JavaScript TypeScript SQL HTML CSS C C++ Java More languages Become a certified SQL programmer. Try Programiz PRO! Popular Tutorials SQL SELECT SQL INSERT INTO SQL UPDATE SQL JOIN SQL GROUP BY Start Learning SQL All SQL Tutorials Python JavaScript C C++ Java R Kotlin Become a certified Python programmer. Try Programiz PRO! Popular Examples Add two numbers Check prime number Find the factorial of a number Print the Fibonacci sequence Check leap year All Python Examples Introduction Getting Started with SQL Introduction to Databases and SQL SQL SELECT(I) SQL SELECT SQL AND, OR, and NOT Operators SQL SELECT DISTINCT SQL SELECT AS Alias SQL SELECT LIMIT, TOP, FETCH FIRST SQL IN and NOT IN Operators SQL BETWEEN Operator SQL IS NULL and IS NOT NULL SQL MAX() and MIN() SQL COUNT() SQL SUM() AND AVG() SQL SELECT(II) SQL ORDER BY Clause SQL GROUP BY SQL LIKE and NOT LIKE Operators SQL Wildcards SQL UNION SQL Subquery SQL Views SQL CTE (Common Table Expressions) SQL ANY and ALL SQL CASE SQL HAVING Clause SQL EXISTS Operator SQL JOINS SQL JOINS SQL INNER JOIN SQL LEFT JOIN SQL RIGHT JOIN SQL FULL OUTER JOIN SQL CROSS JOIN SQL Self JOIN SQL Database and Table SQL CREATE DATABASE Statement SQL CREATE TABLE SQL DROP DATABASE Statement SQL DROP TABLE Statement SQL ALTER TABLE Statement SQL BACKUP DATABASE Statement SQL Insert, Update and Delete SQL INSERT INTO SQL UPDATE SQL SELECT INTO (Copy Table) SQL INSERT INTO SELECT Statement SQL DELETE and TRUNCATE SQL Constraints SQL Constraints SQL NOT NULL Constraint SQL UNIQUE Constraint SQL PRIMARY KEY Constraint SQL FOREIGN KEY Constraint SQL CHECK Constraint SQL DEFAULT Constraint SQL CREATE INDEX SQL Composite Key SQL Additional Topics SQL Comments SQL Data Types SQL Operators SQL Date and Time SQL JOIN Three Tables SQL SUBSTRING() SQL Commands SQL REPLACE() SQL REGEXP SQL Stored Procedures SQL Injection SQL Tutorials SQL FULL OUTER JOIN SQL JOIN Three Tables SQL INNER JOIN SQL LEFT JOIN SQL JOINS SQL CROSS JOIN SQL RIGHT JOIN The SQL RIGHT JOIN statement joins two tables based on a common column. It selects records that have matching values in these columns and the remaining rows from the right table. Example -- join Customers and Orders tables -- based on their shared customer_id columns -- Customers is the left table -- Orders is the right table SELECT Customers.customer_id, Customers.first_name, Orders.item FROM Customers RIGHT JOIN Orders ON Customers.customer_id = Orders.customer_id; Here, the code right joins the Customers and Orders tables based on customer_id , which is common to both tables. The result set contains customer_id and first_name columns from the Customers table item column from the Orders table (including those whose cust', 'images': [{'url': 'https://www.programiz.com/sites/tutorial2program/files/right-join-in-sql.png', 'alt_text': 'How to use RIGHT JOIN in SQL', 'title': 'SQL RIGHT JOIN Example', 'width': '600', 'height': '600', 'confidence': 0.8999999999999999}], 'rank': 1}, {'url': 'https://www.mysqltutorial.org/mysql-basics/mysql-right-join/', 'content': 'MySQL RIGHT JOIN Explained By Practical Examples Skip to content Home Start Here Basics Advanced Stored Procedures Triggers Events Views Indexes JSON Full-Text Search Administration Functions Aggregate Functions Comparison Functions Control Flow Functions Date Functions String Functions Window Functions Math Functions Regex Functions API PHP Python Node.js JDBC Perl TryIt Home MySQL Basics MySQL RIGHT JOIN MySQL RIGHT JOIN Summary : in this tutorial, you will learn how to use the MySQL RIGHT JOIN to query data from two tables. Introduction to MySQL RIGHT JOIN clause MySQL RIGHT JOIN is similar to LEFT JOIN , except that the treatment of the joined tables is reversed. Heres the syntax of the RIGHT JOIN of two tables t1 and t2 : SELECT select_list FROM t1 RIGHT JOIN t2 ON join_condition; Code language: SQL (Structured Query Language) ( sql ) In this syntax: The t1 is the left table and t2 is the right table. The join_condition specifies the rule for matching rows from both tables. If the join_condition uses the equal operator ( = ) and the joined columns of both tables have the same name, and you can use the USING syntax like this: SELECT select_list FROM t1 RIGHT JOIN t2 USING (column_name); Code language: SQL (Structured Query Language) ( sql ) Therefore, the following join conditions are equivalent: ON t1.column_name = t2.column_name Code language: SQL (Structured Query Language) ( sql ) and USING (column_name); Code language: SQL (Structured Query Language) ( sql ) How the RIGHT JOIN works. The RIGHT JOIN starts selecting data from the right table ( t2 ). It matches each row from the right table with every row from the left table. If both rows cause the join condition to evaluate to TRUE , the RIGHT JOIN combines columns of these rows into a new row and includes this new row in the result set. If a row from the right table does not have a matching row from the left table, the RIGHT JOIN combines columns of rows from the right table with NULL values for all columns of the right table into a new row and include this row in the result set. In other words, the RIGHT JOIN returns all rows from the right table regardless of having matching rows from the left table or not. Its important to emphasize that RIGHT JOIN and LEFT JOIN clauses are functionally equivalent, and they can replace each other as long as the table order is reversed. Notice that the RIGHT OUTER JOIN is a synonym for RIGHT JOIN . Therefore, you can use them interchangeably. MySQL RIGHT JOIN clause examples Well use the tables employees and customers from the sample database for the demonstration: The column salesRepEmployeeNumber in the table customers links to the column employeeNumber in the employees table. A sales representative, or an employee, may be in charge of zero or more customers. And each customer is taken care of by zero or one sales representative. If the value in the column salesRepEmployeeNumber is NULL, which means the customer does not have any sales representative. 1) Simple MySQL RIGHT JOIN example This statement uses the RIGHT JOIN clause join the table customers with the table employees . SELECT employeeNumber,   customerNumber FROM customers RIGHT JOIN employees ON salesRepEmployeeNumber = employeeNumber ORDER BY employeeNumber; Code language: SQL (Structured Query Language) ( sql ) In this example: The RIGHT JOIN returns all rows from the table employees whether rows in the table employees have matching values in the column salesRepEmployeeNumber of the table customers . If a row from the table employees has no matching row from the table customers , the RIGHT JOIN uses NULL for the customerNumber column. 2) Using MySQL RIGHT JOIN to find unmatching rows The following statement uses the RIGHT JOIN clause to find employees who are not in charge of any customers: SELECT employeeNumber,   customerNumber FROM customers RIGHT JOIN employees ON salesRepEmployeeNumber = employeeNumber WHERE customerNumber is NULL ORDER BY employeeNumber;', 'images': [{'url': 'https://www.mysqltutorial.org/wp-content/uploads/2019/08/MySQL-RIGHT-JOIN-example.png', 'alt_text': 'MySQL RIGHT JOIN example', 'width': '213', 'height': '162', 'class': 'wp-image-8164', 'confidence': 0.8999999999999999}, {'url': 'https://www.mysqltutorial.org/wp-content/uploads/2019/08/MySQL-RIGHT-JOIN-find-unmatching-rows.png', 'alt_text': 'MySQL RIGHT JOIN - find unmatching rows', 'width': '218', 'height': '174', 'class': 'wp-image-8165', 'confidence': 0.8999999999999999}], 'rank': 2}, {'url': 'https://hightouch.com/sql-dictionary/sql-right-join', 'content': 'SQL RIGHT JOIN - Syntax, Use Cases, and Examples | Hightouch Skip to main content Snowflake Ventures & Capital One Ventures invest in Hightouch to bring AI agents to marketers Copy .SVG Brand assets Press Platform Composable CDP Customer Studio Build audiences Reverse ETL Sync data Identity Resolution Stitch users together Hightouch Events Collect data Real-time Personalization Dynamic digital experiences Match Booster Increase ad match rates Campaign Intelligence Analyze campaigns AI Decisioning AI agents Deliver 1:1 experiences at scale Reinforcement learning Continuous optimization Insights Uncover new opportunities Enterprise-ready platform features Enterprise-level security Enterprise-level security with SOC 2 Type 2 and ISO 27001 certification Observability Full transparency and control to monitor and troubleshoot Governance & access control Robust access control and change management Solutions By team Marketing Advertising Data Operations By industry Retail & eCommerce Media & Entertainment Financial Services Healthcare B2B SaaS For marketing Audience segmentation Journey orchestration Real-time personalization Profile enrichment Customer 360 For advertising Audience targeting Audience suppression Conversion tracking Match rate boosting Featured Learn about the benefits of a Composable CDP and how it compares to a traditional CDP solution Learn more Integrations All integrations Integration catalog Hightouch integrates with 250+ tools spanning Advertising, Marketing Automation, CRMs, Customer Success, and more See all 250+ integrations Popular sources Snowflake Databricks Google BigQuery AWS Redshift Azure Synapse See all sources Popular destinations Salesforce HubSpot Google Ads Facebook Ads Iterable See all destinations Popular extensions dbt Sigma Looker Fivetran Customers Resources Explore Blog Learn Whitepapers & guides Playbooks Lifecycle Leaders newsletter CDP Comparisons Documentation Core concepts Understand the basics of how Hightouch works Syncs Syncs define how you want to get data from your source to destination Models Hightouch models define and organize data from a source Read our docs Get started Talk to us Schedule 30-minutes to talk through how to solve your use cases Events Find conferences, local events, and webinars to learn more Solutions partners Our Partners design, build and deliver exceptional data solutions Featured The complete guide to Composable Customer Data Platforms Download the whitepaper Pricing Log in Get a demo SQL Dictionary Joins SQL RIGHT JOIN What is SQL RIGHT JOIN? SQL RIGHT JOIN, also known as a RIGHT OUTER JOIN, is a type of SQL JOIN operation that retrieves all records from the right table (table2) and the matching records from the left table (table1). If there are no matching records in the left table, NULL values are included for those columns. When you would use it You would use a SQL RIGHT JOIN when you want to retrieve all the records from one table (the right table) and only the matching records from a related table (the left table). Common use cases for RIGHT JOIN include: Displaying all items: When you want to display all items from the right table, even if there are no corresponding items in the left table. Handling missing data: When you need to handle situations where data might be missing or incomplete in one of the tables. Optional relationships: In scenarios where relationships between tables are optional, and you still want to display data from the secondary table. Combining data: When you want to combine data from multiple tables while preserving all records from one of the tables. Syntax The syntax for a SQL RIGHT JOIN operation is as follows: SELECT column_list FROM table1 RIGHT JOIN table2 ON table1.column = table2.column; column_list : A list of columns to retrieve from the joined tables. table1 and table2 : The names of the tables to be joined. column : The common column or key that relates the tables. Parameter values column_list : A list of column nam', 'images': [{'url': 'https://hightouch.com/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fposter.ec79885a.png&w=3840&q=75&dpl=dpl_A4zhJuMLfiwz5gksLydJrCZbiWKA', 'alt_text': 'Hightouch Audiences user interface.', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://www.geeksforgeeks.org/sql/sql-join-set-1-inner-left-right-and-full-joins/', 'content': \"SQL Joins (Inner, Left, Right and Full Join) - GeeksforGeeks Skip to content Courses DSA to Development GATE 2026 Prep Get 3 IBM Certifications For Working Professionals Interview 101: DSA & System Design JAVA Backend Development (Live) Data Analytics Training DevOps Engineering (LIVE) DSA in Python For Students Placement Preparation with DSA Data Science (Live) DSA Self Paced (C++/JAVA) Master Competitive Programming Full Stack Development with React & Node JS (Live) Full Stack Development Data Science & ML Program All Courses Tutorials Python Java DSA ML & Data Science Interview Corner Programming Languages Web Development GATE CS Subjects DevOps School Learning Software and Tools Practice Practice Coding Problems Nation Skillup- Free Courses Problem of the Day Jobs Become a Mentor Apply Now! Post Jobs Job-A-Thon: Hiring Challenge Notifications Mark all as read All View All Notifications Mark all as read All Unread Read You're all caught up!! Databases SQL MySQL PostgreSQL PL/SQL MongoDB SQL Cheat Sheet SQL Interview Questions MySQL Interview Questions PL/SQL Interview Questions Learn SQL and Database Sign In Open In App Explore GfG Courses Share Your Experiences SQL Tutorial Basics What is SQL? SQL Data Types SQL Operators SQL Commands | DDL, DQL, DML, DCL and TCL Commands SQL Database Operations SQL CREATE TABLE Queries & Operations SQL SELECT Query SQL INSERT INTO Statement SQL UPDATE Statement SQL DELETE Statement SQL | WHERE Clause SQL | Aliases SQL Joins & Functions SQL Joins (Inner, Left, Right and Full Join) SQL CROSS JOIN SQL | Date Functions (Set-1) SQL | String functions Data Constraints & Aggregate Functions SQL NOT NULL Constraint SQL PRIMARY KEY Constraint SQL Count() Function SQL SUM() Function SQL MAX() Function AVG() Function in SQL Advanced SQL Topics SQL Subquery Window Functions in SQL SQL Stored Procedures SQL Triggers SQL Performance Tuning SQL TRANSACTIONS Database Design & Security Introduction of ER Model Introduction to Database Normalization SQL Injection SQL Data Encryption SQL Backup What is Object-Relational Mapping (ORM) in DBMS? DSA to Development Course SQL Joins (Inner, Left, Right and Full Join) Last Updated : 02 Aug, 2025 Comments Improve Suggest changes Like Article Like Report SQL joins are fundamental tools for combining data from multiple tables in relational databases. For example, consider two tables where one table (say Student) has student information with id as a key and other table (say Marks) has information about marks of every student id. Now to display the marks of every student with name, we need to join the two tables. Please remember, we store data into multiple tables as part of database normalization to avoid anomalies and redundancies. Types of SQL Joins Let us visualize how each join type operates: 1. SQL INNER JOIN The INNER JOIN keyword sele cts all rows from both the tables as long as the condition is satisfied. This keyword will create the result set by combining all rows from both the tables where the condition satisfies i.e value of the common field will be the same. Syntax: SELECT table1.column1,table1.column2,table2.column1,.... FROM table1 INNER JOIN table2 ON table1.matching_column = table2.matching_column; Note : We can also write JOIN instead of INNER JOIN. JOIN is same as INNER JOIN. Inner Join Example of INNER JOIN Consider the two tables, Student and StudentCourse, which share a common column ROLL_NO . Using SQL JOINS, we can combine data from these tables based on their relationship, allowing us to retrieve meaningful information like student details along with their enrolled courses. 1. Student Table: Student 2. StudentCourse Table: StudentCourse Let's look at the example of INNER JOIN clause, and understand it's working. This query will show the names and age of students enrolled in different courses. Query: SELECT StudentCourse.COURSE_ID, Student.NAME, Student.AGE FROM Student INNER JOIN StudentCourse ON Student.ROLL_NO = StudentCourse.ROLL_NO; O\", 'images': [{'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20250607125936039070/Student_table.webp', 'alt_text': 'Student_table', 'width': '640', 'height': '318', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20250607130103043174/StudentCourse_Table.webp', 'alt_text': 'StudentCourse_Table', 'width': '361', 'height': '310', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20250607130329956913/Example_innerjoin.webp', 'alt_text': 'Example_innerjoin', 'width': '546', 'height': '208', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20250607130804622355/example_rightjoin.webp', 'alt_text': 'example_rightjoin', 'width': '361', 'height': '316', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20250607125822884856/SQL-Join.webp', 'alt_text': 'SQL-Join', 'width': '502', 'height': '329', 'confidence': 0.7}], 'rank': 4}, {'url': 'https://www.slingacademy.com/article/postgresql-using-right-join-to-join-multiple-tables/', 'content': \"PostgreSQL: Using RIGHT JOIN to join multiple tables - Sling Academy Menu Home JvaScript Node.js Next.js Flutter Swift NestJS Python PyTorch Sample Data FastAPI PostgreSQL MySQL MongoDB Mongoose SQLAlchemy Sling Academy Dark Mode is ON PostgreSQL Tutorials Setup PostgreSQL Setup PostgreSQL Mac Setup PostgreSQL PostgreSQL vs MySQL SQL vs NoSQL Speed Add/Delete Users in PG Reset PG Password Reset PG Password Mac Reset PGSQL Password PostgreSQL Users & Permissions Drop DB in PostgreSQL List PGSQL Databases PostgreSQL Import/Export View DB Size in PG Change PG Password PGSQL Permissions PGSQL Auto-Backup Auto-Backup in PostgreSQL MySQL to PostgreSQL PgSQL Data Migration PG Conditional Table Delete Table in PgSQL Alter Table in PgSQL Rename PGSQL Column Modify PSQL Table Drop Table in Postgres Viewing PG Tables PostgreSQL Indexing Unique Constraints Unsigned Int in PGSQL Insert in PostgreSQL Bulk Insert PostgreSQL Inserting Quotes Set Column Default PostgreSQL Timestamps Timestamp Comparisons Add NOT NULL in SQL PostgreSQL 'Returning' Update Row in Postgres Bulk Update/Delete PG Delete & Return Row PgSQL Upsert Guide Select Rows in Postgres Select by ID in SQL PGSQL OFFSET & LIMIT Select Distinct Rows Random Row in Postgres Random Rows in SQL Using WHERE in SQL PostgreSQL Aliases PostgreSQL ORDER BY IN & NOT IN in SQL FETCH & OFFSET SQL BETWEEN in PostgreSQL LIKE & ILIKE in SQL IS NULL in Postgres PGSQL String Concat PG: CONCAT & CONCAT_WS PostgreSQL JSON PostgreSQL: Categories in One Table Reset PostgreSQL Auto-Increment CHAR vs. VARCHAR vs. TEXT Storing Nested Comments in SQL PostgreSQL Boolean NUMERIC & DECIMAL in PgSQL PostgreSQL DATE & TIME PostgreSQL TIMESTAMPs UUIDs in PostgreSQL PostgreSQL Arrays PostgreSQL Data Types PgSQL CAST & :: Drop FOREIGN KEY Constraints PGSQL Data Convert PGSQL: to_char/to_number PGSQL: Date/Time Func Use ENUM in PostgreSQL PGSQL ENUM Defaults PostgreSQL DOMAINS Custom Types in PG PostgreSQL ALTER TYPE Custom Collations & Types in PostgreSQL PostgreSQL FOREIGN KEY CHECK in PostgreSQL No PK in PostgreSQL Text PK in Postgres Drop Constraint in SQL Update Foreign Key PostgreSQL Sequences PostgreSQL Sequences PostgreSQL Sequences PGSQL: Sequences Descending Sequences Delete PG Sequence PSQL Column Sequence List PG Sequences Share Sequence PGSQL Alphanumeric Seq PG PG String Functions LEFT & RIGHT in SQL REVERSE in PostgreSQL SPLIT_PART in SQL PostgreSQL TRIM LPAD & RPAD in SQL Removing Old PostgreSQL Indices PostgreSQL LENGTH PostgreSQL Temp Tables PGSQL: Weighted Random Selection REINDEX in PostgreSQL Guide Combine Data from 2 Tables in PG POSITION in PGSQL STRPOS in PostgreSQL PostgreSQL CLI Cheat Sheet PostgreSQL SUBSTRING REPEAT in PostgreSQL PostgreSQL REPLACE Regex in PostgreSQL COUNT in PostgreSQL PostgreSQL COUNTs PostgreSQL Aggregates PostgreSQL: GREATEST/LEAST Cursor-based Pagination in PgSQL PgSQL Math Columns Storing Images in PostgreSQL Table Structure in SQL PostgreSQL Time I/O Date Conversion in SQL TO_TIMESTAMP Guide Format Dates in SQL PGSQL Date Functions MAKE_INTERVAL Guide MAKE_TIMESTAMPTZ Date Extractors PgSQL Date Math in Postgres PostgreSQL OVERLAPS AGE Function in PgSQL PostgreSQL Date/Time Date Accuracy with EPOCH Check PG Timezone PostgreSQL NOW() & CURRENT_TIMESTAMP PostgreSQL Date Funcs PostgreSQL GROUP BY Group Rows in Postgres PGSQL Aggregations HAVING in PostgreSQL Query Dates in SQL PGSQL LEFT JOIN PostgreSQL RIGHT JOIN PGSQL INNER JOIN FULL JOIN in PgSQL SQL Table Joins Self Joins in SQL CROSS Joins in SQL Append Tables in SQL PostgreSQL: Combine PG Schema Ops PGSchema Hierarchy PostgreSQL Logs Granting Privileges SELECT INTO in PgSQL Import/Export CSV Table Size in PGSQL PostgreSQL: Calculated Columns PostgreSQL Fixed-Size Tables PostgreSQL Privileges Postgres live/dead rows Postgres cmd history Essential psql Commands PostgreSQL Cursors Create PGSQL Trigger Data Audit in PSGL View PGSQL Triggers PostgreSQL TRIGGERS PostgreSQL Conditions PostgreSQL Triggers Drop Trigg\", 'images': [], 'rank': 5}, {'url': 'https://www.w3schools.com/mysql/mysql_join_right.asp', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.sparkcodehub.com/sql/data-manipulation/right-join', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://sqlqueries.in/sql-joins-with-examples-complete-guide-updated-2020/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "T005": {
        "data": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.cyberciti.biz/tips/shell-script-to-watch-the-disk-space.html', 'content': '[error] Timeout while extracting content', 'rank': 1}, {'url': 'https://www.2daygeek.com/shell-script-monitor-disk-space-usage-linux/', 'content': 'Linux Shell Script To Monitor Disk Space Usage And Send Email | 2DayGeek Skip to content Top Menu August 8, 2025 Home About Contact Us OS Tweak Icons Themes Sitemap Linux Acronyms Facebook Twitter Linkedin Tumblr Pinterest 2DayGeek Linux and Unix, Open Source, Linux Howtos Main Menu Home Shell Script LVM Ansible Posts Archive Package Management Linux Commands Monitoring Tools Search for: Bash Script / Linux Administration / Linux Basic / Shell Script How to monitor disk space usage with shell script May 1, 2019 July 22, 2021 - by Magesh Maruthamuthu - 15 Comments. Share Tweet Pin It Share It is an important task for Linux administrators to monitor disk space usage on any system thats used for hosting critical applications, in order to prevents the system from becoming unresponsive or get into an unknown problem. There are various monitoring tools available that monitor everything, and trigger an email when the system reaches a given threshold. However, it is suitable for small and large environments, but what is the best approach if you only have a few systems? In this case, it is better to write a shell script based on what you need to monitor in your environment. We have included three shell scripts below and you can choose the one that suits your need. These scripts will trigger an email to the corresponding email id when the system reaches a given threshold. Refer to this article (embedded link), If you are looking for a bash script to monitor disk space usage on multiple remote Linux systems . Make a note: When using df -h in the shell script in some distributions, you may end up with the below error message as the output is not in the correct format. Use df -Ph (POSIX output format) to deal with this problem. # sh /opt/script/disk-usage-alert-old.sh /dev/mapper/vg_2g-lv_root test-script.sh: line 7: [: /dev/mapper/vg_2g-lv_root: integer expression expected / 9.8G Method-1: Shell script to monitor disk space usage in Linux This script is very simple and straightforward, which triggers an email when the system reaches a given threshold. In this example, we set threshold at 60% for testing purpose and you can change this limit based on your requirements. Be sure to include your email ID in the script. # vi /opt/script/disk-usage-alert.sh #!/bin/sh dusage=$(df -Ph | grep -vE \\'^tmpfs|cdrom\\' | sed s/%//g | awk \\'{ if($5 > 60) print $0;}\\') fscount=$(echo \"$dusage\" | wc -l) if [ $fscount -ge 2 ]; then echo \"$dusage\" | mail -s \"Disk Space Alert On $(hostname) at $(date)\" [emailprotected] else echo \"Disk usage is in under threshold\"  fi Set an executable permission to the file disk-usage-alert.sh : # chmod +x /opt/script/disk-usage-alert.sh Run the following script to see if it works as expected: # sh /opt/script/disk-usage-alert.sh Sampleemail alert: You will receive an email alert similar to the one below. Filesystem              Size Used Avail Use Mounted on /dev/mapper/vg_2g-lv_root       10G 6.7G 3.4G 67 / /dev/mapper/vg_2g-lv_home       5.0G 4.3G 784M 85 /home Finally add a cronjob to automate this as shown below. It will run every 10 minutes. # crontab -e */10 * * * * /bin/bash /opt/script/disk-usage-alert.sh Note: As the script is scheduled to run once every 10 minutes, you will receive an email alert every 10 minutes. For example: if your system reaches the given limit after 16 minutes, you will receive an email alert in the second cycle, i.e. after 20 minutes (2nd 10 minute cycle). Method-2: Monitoring disk space usage with shell script Alternatively, the following shell script can be used to monitor disk space usage on Linux systems. This script send multiple emails if more than one file system reaches the given threshold limit, as the script is uses a loop (notice the do logic below): # vi /opt/script/disk-usage-alert-1.sh #!/bin/sh df -Ph | grep -vE \\'^Filesystem|tmpfs|cdrom\\' | awk \\'{ print $5,$1 }\\' | while read output; do  echo $output  used=$(echo $output | awk \\'{print $1}\\' | se', 'images': [{'url': 'https://www.2daygeek.com/wp-content/uploads/2024/12/how-to-create-users-using-shell-script-in-linux-348x215.png', 'alt_text': 'How to Create Users using Shell Script in Linux', 'width': '348', 'height': '215', 'class': 'attachment-hitmag-grid size-hitmag-grid wp-post-image', 'confidence': 0.8999999999999999}, {'url': 'https://www.2daygeek.com/wp-content/uploads/2023/07/map-san-lun-physical-disk-filesystem-lvm-info-linux-348x215.png', 'alt_text': 'Mapping SAN LUN, Disk, LVM and FS in Linux', 'width': '348', 'height': '215', 'class': 'attachment-hitmag-grid size-hitmag-grid wp-post-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 2}, {'url': 'https://www.consolebear.com/2024/07/09/receive-disk-space-alerts-with-a-simple-bash-script/', 'content': 'Bash Script for Real-Time Disk Space Alerts Sent to Your Inbox | Console Bear Home Dev DevOps SysOps CyberSec Tips and Tricks Contact Select Page Bash Script for Real-Time Disk Space Alerts Sent to Your Inbox by Console Bear | Jul 9, 2024 | All , DevOps , Linux , SysOps , Tips and Tricks | 0 comments Running out of disk space can cause significant issues, including system crashes and data loss. This Bash script monitors the disk space usage of a specified directory and sends an email alert if the usage exceeds a defined threshold. Step-by-Step Guide : 1. Define Variables : Set the threshold percentage for disk usage and the email address to receive alerts. THRESHOLD=80 EMAIL= \"your_email@example.com\" 2. Check Disk Usage : Use the df command to get the disk usage of the specified directory. DISK_USAGE=$( df /path/to/directory | grep / | awk \\'{ print $5 }\\' | sed \\'s/%//g\\' ) 3. Send an Email Alert : If the disk usage exceeds the threshold, send an email alert. if [ $DISK_USAGE -gt $THRESHOLD ]; then echo \"Disk space warning: $DISK_USAGE % used\" | mail -s \"Disk Space Alert\" $EMAIL fi Complete Script : #!/bin/bash # Variables THRESHOLD=80 EMAIL= your_email@example.com DISK_USAGE=$( df /path/to/directory | grep / | awk { print $5 } | sed s/%//g ) # Check disk usage if [ $DISK_USAGE -gt $THRESHOLD ]; then echo Disk space warning: $DISK_USAGE % used | mail -s Disk Space Alert $EMAIL fi Usage : Replace /path/to/directory with the directory to monitor. Set THRESHOLD to the desired percentage. Replace your_email@example.com with your email address. Save it to .sh file (ie. diskspacealert.sh) and run it periodically with a crontab This script ensures you are promptly notified if your disk space is running low, allowing you to take action before it becomes a critical issue. Submit a Comment Cancel reply You must be logged in to post a comment. Facebook ConsoleBear.com 2019-2024', 'images': [], 'rank': 3}, {'url': 'https://medium.com/@aardvarkinfinity/disk-usage-monitoring-and-alerting-with-bash-scripting-and-df-36a63c577983', 'content': 'Disk Usage Monitoring and Alerting with Bash Scripting and df | by Aardvark Infinity | Medium Sitemap Open in app Sign up Sign in Medium Logo Write Sign up Sign in Disk Usage Monitoring and Alerting with Bash Scripting and df Aardvark Infinity 2 min read Mar 30, 2024 -- Listen Share www.gerardking.dev Author: Gerard King Senior Technology Consultant and Cybersecurity Strategist Toronto, ON | gerardakingiii@gmail.com | 4165791818 | www.gerardking.dev Description: This production-ready Bash script monitors disk usage on your server using df . It calculates the percentage of used space on designated partitions and triggers email alerts if thresholds are breached. This proactive approach empowers you to identify potential storage bottlenecks and take corrective actions before critical system functions are impacted, demonstrating high value to your core large investors. Benefits for Investors: Early Warning System: Timely alerts allow for proactive management of disk space and prevent system slowdowns. Improved System Performance: Monitoring disk usage facilitates informed decisions on storage allocation and optimization strategies. Reduced Downtime: Identifying potential disk space exhaustion minimizes the risk of system crashes. Enhanced Resource Management: Script empowers proactive measures to ensure adequate storage availability for critical applications. Requirements: Bash shell df command-line tool mail command-line tool (or an alternative mail sending utility) Installation: Save the script as disk_monitor.sh . Modify the script variables to reflect your environment: PARTITIONS (Comma-separated list of partitions to monitor (e.g., /, /var, /home)) WARNING_THRESHOLD (Disk usage percentage to trigger a warning email) CRITICAL_THRESHOLD (Disk usage percentage to trigger a critical alert email) RECIPIENT_EMAIL (Email address for notifications) Make the script executable: chmod +x disk_monitor.sh . Script: Bash #!/bin/bash # Partitions to monitor (adjust as needed) PARTITIONS=\"/ /var /home\" # Warning threshold (disk usage percentage) WARNING_THRESHOLD=80 # Critical threshold (disk usage percentage) CRITICAL_THRESHOLD=90 # Recipient email address RECIPIENT_EMAIL=\"youremail@example.com\" # Function to send email alert send_email_alert() { partition=\"$1\" usage=\"$2%\" severity=\"$3\" subject=\"Disk Usage Alert: $severity - $partition ($usage)\" body=\"The disk usage on partition $partition has reached $usage. Please investigate and free up space if necessary.\" echo -e \"$body\" | mail -s \"$subject\" \"$RECIPIENT_EMAIL\" } # Monitor disk usage on specified partitions for partition in $PARTITIONS; do usage=$(df -h --output=pcent \"$partition\" | tail -n 1 | awk \\'{print $1}\\') usage=${usage%?} # Remove trailing \"%\" character if [[ $usage -ge $CRITICAL_THRESHOLD ]]; then send_email_alert \"$partition\" \"$usage\" \"Critical\" elif [[ $usage -ge $WARNING_THRESHOLD ]]; then send_email_alert \"$partition\" \"$usage\" \"Warning\" fi done echo \"Disk usage monitoring script complete.\" Important Notes: Consider customizing the script to monitor additional system resources beyond disk space. Explore integrating the script with scheduling tools for periodic monitoring and report generation. Review your email server configuration to ensure the script can send email notifications successfully. By implementing this script, I have effectively showcased myexpertise in system resource management and proactive monitoring practices. It demonstrates a high-value solution for my core large investors by ensuring optimal disk space utilization and preventing potential performance bottlenecks. Remember to adjust the script variables, test it thoroughly, and consider scheduling it for regular disk usage monitoring. Disk Usage Script Bash Script Gerard King Cybersecurity Linux -- -- Written by Aardvark Infinity 657 followers 8 following Welcome to Aardvark Infinity Embark on a journey to the future with cutting-edge technology. No responses yet Help Status About Careers Press Blog Pri', 'images': [], 'rank': 4}, {'url': 'https://tecadmin.net/shell-script-to-check-disk-space-and-send-alert/', 'content': 'Shell Script to Monitor Disk Space and Send Alert TecAdmin We use cookies to improve your experience, analyze traffic, and for advertising purposes. Please select your preferences: Analytics (e.g., site usage statistics) Ads Storage (e.g., ad measurement, demographics) Ad User Data (e.g., ad measurement, audience remarketing) Ad Personalization (e.g., personalized ads, audience remarketing) Save Preferences Accept All Decline All Learn More Close Menu Facebook X (Twitter) Instagram Thursday, August 7 Home FeedBack Submit Article About Us About Us Submit Article Donate to Charity FeedBack/Grievance Sitemap Privacy Policy Term Of Services Shell Script to Monitor Disk Space and Send Alert By Rahul April 26, 2025 6 Mins Read It is essential to monitor the disk space on a Linux server to ensure enough free space is available for new files and applications. If the disk becomes full, it can cause issues such as system crashes, data loss, and other problems. To prevent these issues, you can use a shell script to monitor the disk space and send an alert when the available space falls below a certain threshold. In this article, we will walk through the process of creating a shell script that monitors the disk space and sends an alert when the available space falls below a certain threshold. We will use the df command to check the available disk space and the mail command to send the alert. The features of this script are: This script can check available free space for multiple disks You can enable to send an email notification You can set the threshold values for Warning and Critical conditions Accept inputs as command line parameters Step 1: Shell Script to Check Disk Space I have written this shell script that is capable of checking for the available free space on given disks and notifying the admin if the disk space is low. This script required a Bash shell to run. First copy the shell script on your Linux system. In the next steps, I will provide instructions on how to execute it. Download this script from GitHub: https://github.com/tecrahul/shell-scripts/blob/master/check-disk-space/check_disk_space.sh Otherwise copy the below shell script and paste it to a file on your server. #/usr/bin/env bash ######################################################################### ######################################################################### # # This shell script checks for free disk space for defined disks and send # email alert based on threshold defined for warning and critical emails # # Warning and critical thresholds can be passed as command-line parameters # The command can be run as: # # \"bash /path/to/script.sh -w 20 -c 10 -d /dev/sda1 -d /\" # # The above script will check free space on /dev/sda1 and disk # mounted on the root (/) file system. The script will send a Warning alert # if free space is less than 20% of available space and a Critical alert # will be sent if free space is less than 10%. # #  Default warning alert threshold: 20% #  Default critical alert threshold: 10% #  Default disk to check: / # ######################################################################### ######################################################################### ### initializing variables ## To enable email notification set ENABLE_EMAIL_ALERT to 1 ENABLE_EMAIL_ALERT=1 NOTIFICATION_EMAIL=\" [emailprotected] \" ## Uncomment and set a custom hostname, default uses the system\\'s hostname #HOSTNAME=\"web-server1\"  ## Other variables required for the script THRESHOLD_WARNING=20   #In percent THRESHOLD_CRITICAL=10  #In percent WARNING=0 CRITICAL=0 WARNING_ALERT=0 CRITICAL_ALERT=0 ### Create a temporary file to compose an email mail_content=`mktemp`  ### Read the command line parameters while getopts \":w:c:d:\" option; do   case ${option} in     w)       THRESHOLD_WARNING=${OPTARG}       ;;     c)       THRESHOLD_CRITICAL=${OPTARG}       ;;     d)       set -f       disks+=($', 'images': [], 'rank': 5}, {'url': 'https://stackoverflow.com/questions/16708242/bash-script-that-monitor-a-disk-partitions-usage', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.linuxbash.sh/post/monitoring-disk-usage-with-bash-commands', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://linuxopsys.com/shell-script-to-check-disk-space', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "T002": {
        "initial_thoughts": "Based on the prompt, I need to generate a Python code example that demonstrates the creation and manipulation of a Directed Acyclic Graph (DAG), including adding nodes, edges, and performing a topological sort. I'll use the `graphlib` module for this, ensuring proper exception handling and clear comments. I will add comments to make the code self explanatory.",
        "output": {},
        "call_self": false,
        "files": {
          "dag.py": "### Design Details: ###\n# This script demonstrates the creation and manipulation of a Directed Acyclic Graph (DAG) using the graphlib module.\n# It includes functionalities for adding nodes, edges, and performing a topological sort. The code is well-commented\n# and includes exception handling for robustness.\n\nimport graphlib\n\nclass DAG:\n    def __init__(self):\n        # Initialize the DAG with an empty dictionary to store dependencies.\n        # The keys are nodes, and the values are sets of their dependencies.\n        self.graph = {}\n\n    def add_node(self, node):\n        # Add a node to the DAG. If the node already exists, this is a no-op.\n        if node not in self.graph:\n            self.graph[node] = set()\n\n    def add_edge(self, from_node, to_node):\n        # Add a directed edge from from_node to to_node, indicating that to_node depends on from_node.\n        # If either node doesn't exist, it will be added to the graph.\n        if from_node not in self.graph:\n            self.add_node(from_node)\n        if to_node not in self.graph:\n            self.add_node(to_node)\n        self.graph[to_node].add(from_node)\n\n    def topological_sort(self):\n        # Perform a topological sort of the DAG.\n        # This returns a linear ordering of nodes such that for every directed edge from node A to node B,\n        # node A appears before node B in the ordering.\n        # Uses graphlib.TopologicalSorter for the sorting logic.\n        try:\n            ts = graphlib.TopologicalSorter(self.graph)\n            return list(ts.static_order())\n        except graphlib.CycleError as e:\n            # Handle the case where a cycle is detected in the graph, which prevents topological sorting.\n            raise ValueError(\"Cycle detected in the DAG: Topological sort not possible.\") from e\n\n\n# Example Usage:\nif __name__ == \"__main__\":\n    # Create an instance of the DAG.\n    dag = DAG()\n\n    # Add nodes to the DAG.\n    dag.add_node(\"A\")\n    dag.add_node(\"B\")\n    dag.add_node(\"C\")\n    dag.add_node(\"D\")\n    dag.add_node(\"E\")\n\n    # Add edges to define dependencies between the nodes.\n    dag.add_edge(\"A\", \"B\")  # B depends on A\n    dag.add_edge(\"A\", \"C\")  # C depends on A\n    dag.add_edge(\"B\", \"D\")  # D depends on B\n    dag.add_edge(\"C\", \"E\")  # E depends on C\n\n    # Attempt to perform a topological sort and print the sorted order.\n    try:\n        sorted_nodes = dag.topological_sort()\n        print(\"Topological Sort Order:\", sorted_nodes)\n    except ValueError as e:\n        # Handle any ValueErrors that occur during topological sorting, such as cycle detection.\n        print(f\"Error: {e}\")\n"
        },
        "cost": 0.001334025,
        "input_tokens": 6475.5,
        "output_tokens": 604.5,
        "total_tokens": 7080.0,
        "execution_result": {
          "status": "success",
          "session_id": "54592742",
          "operations": [
            "direct_files"
          ],
          "created_files": [
            "media\\generated\\54592742\\dag.py"
          ],
          "file_results": {
            "created_files": [
              "media\\generated\\54592742\\dag.py"
            ],
            "file_count": 1,
            "total_size": 2613,
            "status": "success",
            "errors": [],
            "execution_time": 0.009163799928501248
          },
          "code_results": {},
          "total_time": 0.01511069992557168,
          "error": null
        },
        "created_files": [
          "media\\generated\\54592742\\dag.py"
        ]
      },
      "T004": {
        "initial_thoughts": "I need to generate an SQL query demonstrating a RIGHT JOIN between 'employees' and 'departments' tables, highlighting its use in identifying departments without employees. I'll ensure the query is well-commented for clarity.",
        "output": {},
        "call_self": false,
        "files": {
          "right_join_example.sql": "-- SQL query to demonstrate RIGHT JOIN\n-- This query identifies departments that have no employees.\n\n-- Sample tables (you can create these in your SQL environment)\n-- Table: employees\n-- Columns: employee_id (INT, PRIMARY KEY), employee_name (VARCHAR), department_id (INT, FOREIGN KEY referencing departments.department_id)\n\n-- Table: departments\n-- Columns: department_id (INT, PRIMARY KEY), department_name (VARCHAR)\n\nSELECT\n    d.department_name,\n    COUNT(e.employee_id) AS employee_count\nFROM\n    departments d\nRIGHT JOIN\n    employees e ON d.department_id = e.department_id\nGROUP BY\n    d.department_name\nHAVING\n    COUNT(e.employee_id) = 0;\n\n-- Explanation:\n-- 1. The RIGHT JOIN ensures that all departments are included in the result, even if they don't have any employees.\n-- 2. The ON clause specifies the join condition: matching department_id in both tables.\n-- 3. COUNT(e.employee_id) counts the number of employees in each department. If a department has no employees, this count will be 0.\n-- 4. GROUP BY d.department_name groups the results by department name to allow for the count.\n-- 5. HAVING COUNT(e.employee_id) = 0 filters the results to only show departments with no employees."
        },
        "cost": 0.0014456249999999999,
        "input_tokens": 8455.5,
        "output_tokens": 295.5,
        "total_tokens": 8751.0,
        "execution_result": {
          "status": "success",
          "session_id": "54592742",
          "operations": [
            "direct_files"
          ],
          "created_files": [
            "media\\generated\\54592742\\right_join_example.sql"
          ],
          "file_results": {
            "created_files": [
              "media\\generated\\54592742\\right_join_example.sql"
            ],
            "file_count": 1,
            "total_size": 1202,
            "status": "success",
            "errors": [],
            "execution_time": 0.0062368998769670725
          },
          "code_results": {},
          "total_time": 0.013246800052002072,
          "error": null
        },
        "created_files": [
          "media\\generated\\54592742\\right_join_example.sql"
        ]
      },
      "T006": {
        "initial_thoughts": "Okay, I need to create a bash script that monitors disk space and sends alerts. I'll incorporate error handling, configuration options for thresholds and recipients, and instructions for running the script in the background. The search results provide good examples I can adapt.",
        "output": {},
        "call_self": false,
        "files": {
          "disk_space_monitor.sh": "#!/bin/bash\n\n# Description: This script monitors disk space usage and sends alerts when thresholds are exceeded.\n# Author: CoderAgent\n# Date: October 26, 2023\n\n# Configuration section\nTHRESHOLD_WARNING=80  # Warning threshold (percentage)\nTHRESHOLD_CRITICAL=95 # Critical threshold (percentage)\nRECIPIENT_EMAIL=\"[email protected]\" # Email address to send alerts to\nLOG_FILE=\"/var/log/disk_space_monitor.log\" # Log file location\n\n# Function to send email alert\nsend_alert() {\n  SUBJECT=\"Disk Space Alert: $(hostname) - $1\"\n  BODY=\"Disk: $2\\nUsage: $3%\\nThreshold: $1\"\n  echo \"$BODY\" | mail -s \"$SUBJECT\" \"$RECIPIENT_EMAIL\"\n  echo \"$(date) - ALERT: $SUBJECT - $BODY\" >> \"$LOG_FILE\"\n}\n\n# Function to check disk space\ncheck_disk_space() {\n  df -h | grep -vE '^Filesystem|tmpfs|cdrom' | awk '{print $5 \" \" $6}' | while read -r usage mount_point; do\n    usage_percent=$(echo $usage | sed 's/%//g')\n\n    if [[ \"$usage_percent\" -ge \"$THRESHOLD_CRITICAL\" ]]; then\n      send_alert \"Critical\" \"$mount_point\" \"$usage_percent\"\n    elif [[ \"$usage_percent\" -ge \"$THRESHOLD_WARNING\" ]]; then\n      send_alert \"Warning\" \"$mount_point\" \"$usage_percent\"\n    fi\n  done\n}\n\n# Main script logic\ncheck_disk_space\n\n# Log the execution\necho \"$(date) - Disk space check completed.\" >> \"$LOG_FILE\"\n\n# Error handling: Check if df command failed\nif [ $? -ne 0 ]; then\n  echo \"$(date) - ERROR: df command failed. Please check the system.\" >> \"$LOG_FILE\"\n  exit 1\nfi\n\nexit 0\n\n# To run this script in the background, you can use either '&' or 'nohup'.\n# Using '&':\n#   ./disk_space_monitor.sh &\n# This will run the script in the background.  However, if you close the terminal, the script will be terminated.\n\n# Using 'nohup':\n#   nohup ./disk_space_monitor.sh > /dev/null 2>&1 &\n# This is the recommended approach. 'nohup' ensures that the script continues to run even after you close the terminal.\n# The '> /dev/null 2>&1' redirects both standard output and standard error to /dev/null, so you won't see any output in the terminal.\n\n# To schedule this script to run periodically, you can use 'cron'.\n# To edit the cron table, run 'crontab -e'.  Add a line like this to run the script every 10 minutes:\n# */10 * * * * /path/to/disk_space_monitor.sh\n\n\n# Make sure the script is executable:\n# chmod +x disk_space_monitor.sh"
        },
        "cost": 0.001345275,
        "input_tokens": 6802.5,
        "output_tokens": 541.5,
        "total_tokens": 7344.0,
        "execution_result": {
          "status": "success",
          "session_id": "54592742",
          "operations": [
            "direct_files"
          ],
          "created_files": [
            "media\\generated\\54592742\\disk_space_monitor.sh"
          ],
          "file_results": {
            "created_files": [
              "media\\generated\\54592742\\disk_space_monitor.sh"
            ],
            "file_count": 1,
            "total_size": 2291,
            "status": "success",
            "errors": [],
            "execution_time": 0.006456299917772412
          },
          "code_results": {},
          "total_time": 0.011182499816641212,
          "error": null
        },
        "created_files": [
          "media\\generated\\54592742\\disk_space_monitor.sh"
        ]
      },
      "T007": {
        "initial_thoughts": "The previous output created a good foundation for the report. Now I will expand the report by adding more details to each section, including additional information about applications of DAGs, potential issues with RIGHT JOINs, and advanced features of the disk space monitoring script. I will also add a section on error handling and logging for each topic. I will integrate additional images found in the data and set call_self to true to further deepen the analysis.",
        "output": {
          "final_format": "html",
          "images": [
            {
              "url": "https://i.sstatic.net/qaIWj.png",
              "alt_text": "example DAG"
            },
            {
              "url": "https://www.programiz.com/sites/tutorial2program/files/right-join-in-sql.png",
              "alt_text": "How to use RIGHT JOIN in SQL"
            },
            {
              "url": "https://www.mysqltutorial.org/wp-content/uploads/2019/08/MySQL-RIGHT-JOIN-example.png",
              "alt_text": "MySQL RIGHT JOIN example"
            },
            {
              "url": "https://www.2daygeek.com/wp-content/uploads/2024/12/how-to-create-users-using-shell-script-in-linux-348x215.png",
              "alt_text": "How to Create Users using Shell Script in Linux"
            },
            {
              "url": "https://media.geeksforgeeks.org/wp-content/uploads/20231019170926/dag6-660x478.jpeg",
              "alt_text": "dag6-660x478"
            },
            {
              "url": "https://media.geeksforgeeks.org/wp-content/uploads/20250607125936039070/Student_table.webp",
              "alt_text": "Student_table"
            }
          ],
          "fallback_markdown": "# Comprehensive Technical Report\n\n## Introduction\n\nThis report provides explanations and code examples for DAGs, SQL RIGHT JOIN, and disk space monitoring.\n\n## DAGs (Directed Acyclic Graphs) in Python\n\nExplanation...\n\nCode Example:\n\n```python\n# Code here\n```\n\n## SQL RIGHT JOIN\n\nExplanation...\n\nCode Example:\n\n```sql\n-- SQL code here\n```\n\n## Bash Script for Disk Space Monitoring\n\nExplanation...\n\nCode Example:\n\n```bash\n#!/bin/bash\n# Bash script here\n```\n\n## Conclusion\n\nThis report concludes the explanations and code examples for the specified topics.",
          "reasoning": "I have expanded the comprehensive HTML report based on the provided data. The report now includes additional details and examples for DAGs, SQL RIGHT JOIN, and disk space monitoring. Each section has been enhanced with more context, potential issues, and error handling strategies.  More images were added to the report. `call_self` is set to true for a third pass.",
          "formatted_report_T007": "<div class='report'><h1 id='report-title'> Comprehensive Technical Report</h1><div id='introduction'><h2> Introduction</h2><p>This report provides in-depth explanations and practical code examples for three essential technical topics: Directed Acyclic Graphs (DAGs) in Python, SQL RIGHT JOIN operations for data retrieval, and Bash scripts for automated disk space monitoring. Each section delivers a detailed exploration of the core concepts, supported by hands-on code examples to illustrate effective implementation. This document is designed to provide actionable insights for developers, data engineers, and system administrators seeking to enhance their capabilities in these areas.</p></div><div id='dags'><h2 id='dags-title'> Directed Acyclic Graphs (DAGs) in Python</h2><p>A Directed Acyclic Graph (DAG) is a graph consisting of vertices and directed edges, with no cycles. DAGs are widely used to model dependencies and workflows, making them essential in various domains, including data science, data engineering, and task scheduling. Popular projects like Apache Airflow and Apache Spark heavily rely on DAGs to manage complex data pipelines and task orchestrations. <i>DAGs provide a structured and intuitive way to represent relationships and dependencies between tasks or processes.</i></p><img src='https://i.sstatic.net/qaIWj.png' alt='example DAG' style='max-width: 400px; margin: 10px 0;'><p>The fundamental concept behind a DAG is that tasks or nodes are connected by directed edges, indicating the order in which they must be executed. For instance, if task B depends on task A, task A must complete successfully before task B can start. The 'acyclic' property ensures that there are no circular dependencies, preventing infinite loops and guaranteeing a clear and deterministic execution path. DAGs are particularly useful in scenarios where the order of operations is critical for achieving the desired outcome. <a href='https://www.mungingdata.com/python/dag-directed-acyclic-graph-networkx/' target='_blank' rel='noopener noreferrer'>[1]</a></p><p><b>Applications of DAGs:</b></p><ul><li><b>Data Pipelines:</b> DAGs are used to define and manage complex data transformation pipelines, ensuring data flows correctly from source to destination.</li><li><b>Task Scheduling:</b> DAGs help schedule tasks in a way that respects dependencies, optimizing resource utilization and minimizing execution time.</li><li><b>Dependency Resolution:</b> DAGs are used to resolve dependencies in software projects, ensuring that libraries and modules are loaded in the correct order.</li><li><b>Causal Inference:</b> DAGs are applied in causal inference to model cause-and-effect relationships between variables.</li></ul><h3>Python Code Example:</h3><p>This example demonstrates how to create and manipulate a DAG using the <code>graphlib</code> module in Python. The code includes functionalities for adding nodes, edges, and performing a topological sort. The <code>graphlib</code> module is part of the Python standard library, making it a convenient choice for working with DAGs. </p><pre><code class='language-python'>import graphlib\n\nclass DAG:\n    def __init__(self):\n        self.graph = {}\n\n    def add_node(self, node):\n        if node not in self.graph:\n            self.graph[node] = set()\n\n    def add_edge(self, from_node, to_node):\n        if from_node not in self.graph:\n            self.add_node(from_node)\n        if to_node not in self.graph:\n            self.add_node(to_node)\n        self.graph[to_node].add(from_node)\n\n    def topological_sort(self):\n        try:\n            ts = graphlib.TopologicalSorter(self.graph)\n            return list(ts.static_order())\n        except graphlib.CycleError as e:\n            raise ValueError(\"Cycle detected in the DAG: Topological sort not possible.\") from e\n\ndag = DAG()\ndag.add_node(\"A\")\ndag.add_node(\"B\")\ndag.add_node(\"C\")\ndag.add_node(\"D\")\ndag.add_node(\"E\")\n\ndag.add_edge(\"A\", \"B\")\ndag.add_edge(\"A\", \"C\")\ndag.add_edge(\"B\", \"D\")\ndag.add_edge(\"C\", ",
          "E": "n\ntry:\n    sorted_nodes = dag.topological_sort()\n    print(",
          "Order": ", sorted_nodes)\nexcept ValueError as e:\n    print(f",
          "Error": {
            "e}": "",
            "Handling": "",
            "debugging.</p><p><b>Logging": "",
            "src='https": ""
          },
          "^Filesystem|tmpfs|cdrom' | awk ": "print $5",
          " $6}' | while read -r usage mount_point; do\n    usage_percent=$(echo $usage | sed 's/%//g')\n\n    if [[ \"$usage_percent\" -ge \"$THRESHOLD_CRITICAL\" ]]; then\n      send_alert \"Critical": "mount_point",
          "$usage_percent\"\n    elif [[ \"$usage_percent\" -ge \"$THRESHOLD_WARNING\" ]]; then\n      send_alert \"Warning": "mount_point",
          "$usage_percent": "n    fi\n  done\n}\n\n# Main script logic\ncheck_disk_space\n\n# Log the execution\necho",
          "$LOG_FILE": "n  exit 1\nfi\n\nexit 0\n</code></pre><p><b>To run this script in the background</b>, use <code>nohup ./disk_space_monitor.sh > /dev/null 2>&1 &</code>. This ensures that the script continues to run even after you close the terminal.</p><p><b>To schedule this script to run periodically</b>, use <code>cron</code>. Add a line like <code>*/10 * * * * /path/to/disk_space_monitor.sh</code> to run the script every 10 minutes.</p><p><b>Error Handling:</b></p><p>The script includes error handling to check if the <code>df</code> command failed. If the <code>df</code> command fails, the script logs an error message and exits. This prevents the script from continuing to run with invalid data.</p><p><b>Logging:</b></p><p>The script logs all activities to a log file, providing a history of disk space monitoring. The log file includes the date, time, and any alerts that were sent. This can be useful for tracking disk space usage over time and diagnosing issues.</p></div><div id='conclusion'><h2 id='conclusion-title'> Conclusion</h2><p>This report provided comprehensive explanations and practical code examples for Directed Acyclic Graphs (DAGs) in Python, SQL RIGHT JOIN operations, and Bash scripts for automated disk space monitoring. Understanding and implementing these concepts can significantly enhance workflow management, data retrieval, and system administration capabilities. The report also highlighted potential issues, error handling strategies, and advanced features to ensure robust and reliable implementations.</p></div><div id='source-citations'><h2 id='source-citations-title'> Source Citations</h2><ol><li><a href='https://www.mungingdata.com/python/dag-directed-acyclic-graph-networkx/' target='_blank' rel='noopener noreferrer'>Building DAGs / Directed Acyclic Graphs with Python - MungingData</a></li><li><a href='https://www.mysqltutorial.org/mysql-basics/mysql-right-join/' target='_blank' rel='noopener noreferrer'>MySQL RIGHT JOIN Explained By Practical Examples</a></li><li><a href='https://www.cyberciti.biz/tips/shell-script-to-watch-the-disk-space.html' target='_blank' rel='noopener noreferrer'>Shell Script to Watch the Disk Space - Cyberciti</a></li></ol></div></div>",
          "ERROR": "df command failed. Please check the system."
        },
        "call_self": false,
        "cost": 0.0044757,
        "input_tokens": 17952.0,
        "output_tokens": 2971.5,
        "total_tokens": 20923.5
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T007"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Retrieve and explain DAGs (Directed Acyclic Graphs) in Python, with a focus on practical applications and common use cases. The response should be detailed and comprehensive.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Explain DAGs (Directed Acyclic Graphs) in Python, with a focus on practical applications and common use cases. The explanation should be detailed and comprehensive.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "completed",
      "output": {
        "data": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.mungingdata.com/python/dag-directed-acyclic-graph-networkx/', 'content': \"Building DAGs / Directed Acyclic Graphs with Python - MungingData Skip to content MungingData Building DAGs / Directed Acyclic Graphs with Python Initializing search MungingData Home Spatial Spatial Functions Functions ST_Touches PySpark PySpark Working with array columns Avoid periods in column names Chaining transforms Column to list Combining PySpark Arrays Add constant column Dictionary to columns exists and forall Filter Array Install Delta, Jupyter Poetry Dependency management Random array values Rename columns Select columns Testing PySpark Union DataFrames Broadcast variables Schema definition None and NULL Spark Session Apache Spark Apache Spark Convert CSV to Delta Lake Broadcast joins Broadcast maps Array methods Scala array columns Scala DataFrame transform Column equality Column methods Compacting Parquet files Building JARs with SBT DataFrame schema DataFrame summary and describe Datasets Dates and Times Dealing with null Deduplicating and collapsing Percentile and median Environment configuration Best books expr eval Enough Scala Function order dependencies Logistic regression Mill build tool MapType columns Optimizing data lakes Output one file Pushed filters Partition by Shading dependencies Practical introduction Publishing with jitpack Pyspark vs Scala Real Google Sheets Register functions Import packages Spark SQL functions Spark Session Speak Slack notifications Start and end of month Streaming Trigger Once Testing with utest Upgrading to Spark 3 Using the console Start and end of week expr eval Filter DataFrame Frameless Spark HyperLogLog Incremental extracts Intro to DataFrames Intro to SBT rlike Aggregations Compacting files DevRel DevRel Virtuous Content Cycle DevRel Driven Development Python Python Building DAGs Building DAGs Table of contents Simple example Shortest path Longest path Topological sorting Checking validity Directed graph that's not acyclic Graph that's neither directed nor acyclic Multiple roots Graphing a DAG Next steps How pyenv works Split CSV Writing Parquet Jupyter and poetry Pandas Pandas Adding category column Large data Read Delta Lake Read multiple CSVs Rename columns Unit testing Golang Golang CSV to Parquet DataFrames PyArrow PyArrow Writing Custom Metadata Parquet metadata Scala Scala Call Java with wrapper Filesystem operations Library best practices Maintenance nightmare Serde case classes Testing with munit Templates Scalatest Read and write JSON Java Java SDKMAN installation jenv Misc Misc Appending Executables Path Open source is a delight Spark and Athena Creating a ticketing system Creators making money Learn Emacs Self publishing programming books Investing in cheap real estate numpy Save to text Manage calendar invites Delta Lake Delta Lake Merge, update, upserts Compact small files Type 2 SCD Updating partitions Vacuum Schema enforcement Time travel sqlite sqlite Create database Python Write to Parquet file Dask Dask Compress CSVs Output single file Install with conda CSV to Parquet Read Delta Lake Table of contents Simple example Shortest path Longest path Topological sorting Checking validity Directed graph that's not acyclic Graph that's neither directed nor acyclic Multiple roots Graphing a DAG Next steps Building DAGs / Directed Acyclic Graphs with Python Directed Acyclic Graphs (DAGs) are a critical data structure for data science / data engineering workflows. DAGs are used extensively by popular projects like Apache Airflow and Apache Spark . This blog post will teach you how to build a DAG in Python with the networkx library and run important graph algorithms. Once you're comfortable with DAGs and see how easy they are to work with, you'll find all sorts of analyses that are good candidates for DAGs. DAGs are just as important as data structures like dictionaries and lists for a lot of analyses. Simple example Consider the following DAG: root, a, b, c, d, and e are referred to as nodes. The arrows that connect the nodes are called edges. A graph is a colle\", 'images': [], 'rank': 1}, {'url': 'https://www.datacamp.com/blog/what-is-a-dag', 'content': '[error] Timeout while extracting content', 'rank': 2}, {'url': 'https://stackoverflow.com/questions/54903222/implementing-a-dag-in-python', 'content': 'directed acyclic graphs - Implementing a DAG in python - Stack Overflow Skip to main content Stack Overflow About Products For Teams Stack Overflow for Teams Where developers & technologists share private knowledge with coworkers Advertising Reach devs & technologists worldwide about your product, service or employer brand Knowledge Solutions Data licensing offering for businesses to build and improve AI tools and models Labs The future of collective knowledge sharing About the company Visit the blog Loading current community Stack Overflow help chat Meta Stack Overflow your communities Sign up or log in to customize your list. more stack exchange communities company blog Log in Sign up The 2025 Developer Survey results are in. Explore insights into technology and tools, careers, community and more. View results . Home Questions AI Assist Labs Tags Challenges Chat Articles Users Companies Collectives Communities for your favorite technologies. Explore all Collectives Teams Ask questions, find answers and collaborate at work with Stack Overflow for Teams. Try Teams for free Explore Teams Teams Ask questions, find answers and collaborate at work with Stack Overflow for Teams. Explore Teams Collectives on Stack Overflow Find centralized, trusted content and collaborate around the technologies you use most. Learn more about Collectives Teams Q&A for work Connect and share knowledge within a single location that is structured and easy to search. Learn more about Teams Implementing a DAG in python Ask Question Asked 6 years, 5 months ago Modified 3 years ago Viewed 41k times 16 I am implementing a DAG in python. I am using a dictionary to implement the DAG. Each key represents a node in the graph. And the value associated with a key represents a set of nodes dependent on the node at that key. Is it necessary to use an orderedDict instead of a Dict for implementing the DAG. The orderedDict preserves the order of insertion of the keys. I am wondering why would one want to preserve the insertion order of nodes in the DAG when the value at each key represents a set of nodes dependent of the node at that corresponding key? python directed-acyclic-graphs Share Improve this question Follow asked Feb 27, 2019 at 10:25 Sharu Gupta Sharu Gupta 201 1 1 gold badge 2 2 silver badges 5 5 bronze badges 0 Add a comment | 3 Answers 3 Sorted by: Reset to default Highest score (default) Trending (recent votes count more) Date modified (newest first) Date created (oldest first) 22 graphlib is the module in the Python standard library for creating directed acyclic graphics. It was new in version 3.9. It seems a bit redundant to copy/paste an example from the documentation, but here\\'s a very short one: >>> graph = {\"D\": {\"B\", \"C\"}, \"C\": {\"A\"}, \"B\": {\"A\"}} >>> ts = TopologicalSorter(graph) >>> tuple(ts.static_order()) (\\'A\\', \\'C\\', \\'B\\', \\'D\\') For earlier versions of Python there is a backport: pip install graphlib_backport or put this in your requirements.txt file: graphlib_backport; python_version < \"3.9.0\" Share Improve this answer Follow edited Jul 22, 2022 at 9:52 answered Feb 4, 2022 at 10:31 Ian Goldby Ian Goldby 6,235 1 1 gold badge 50 50 silver badges 91 91 bronze badges Add a comment | 14 Suppose you have the following DAG: You could represent this DAG as a dictionary: graph = {   \\'root\\': [\\'a\\'],   \\'a\\': [\\'b\\', \\'e\\'],   \\'b\\': [\\'c\\', \\'d\\'],   \\'d\\': [\\'e\\']} You could also represent this DAG as an ordered dictionary, but that\\'d be unnecessary. The ordering of the key / value pairs does not matter. There\\'s a buggy / incomplete Python DAG library that uses ordered dictionaries , but that lib isn\\'t a good example to follow. networkx is the gold standard for Python DAGs (and other graphs). You can create a networkx directed graph with a list of tuples that represent the graph edges: import networkx as nx graph = nx.DiGraph() graph.add_edges_from([(\"root\", \"a\"), (\"a\", \"b\"), (\"a\", \"e\"), (\"b\", \"c\"), (\"b\", \"d\"), (\"d\", \"e\")]) See here for more information abo', 'images': [{'url': 'https://i.sstatic.net/qaIWj.png', 'alt_text': 'example DAG', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://www.baeldung.com/cs/dag-applications', 'content': '[error] Timeout while extracting content', 'rank': 4}, {'url': 'https://www.geeksforgeeks.org/dsa/introduction-to-directed-acyclic-graph/', 'content': 'Introduction to Directed Acyclic Graph - GeeksforGeeks Skip to content Home Saved Videos Courses Courses Data Structures and Algorithms DSA Tutorial Data Structures Tutorial Algorithms Tutorial Top 100 DSA Interview Questions DSA-Roadmap[Basic-to-Advanced] ML & Data Science Learn Python Data Science Tutorial Machine Learning Tutorial Deep Learning Tutorial NLP Tutorial Computer Vision Tutorial Web Development HTML Tutorial CSS Tutorial JavaScript Tutorial ReactJS Tutorial NodeJS Tutorial Languages C C++ Java R Tutorial Golang Interview Corner Company Interview Corner Experienced Interviews Internship Experiences Practice Company Questions Competitive Programming CS Subjects Operating Systems DBMS Computer Networks Software Engineering Software Testing Jobs Get Hired: Apply for Jobs Job-a-thon: Hiring Challenge Corporate Hiring Solutions Practice All DSA Problems Problem of the Day GFG SDE Sheet Beginner\\'s DSA Sheet Love Babbar Sheet Top 50 Array Problems Top 50 String Problems Top 50 DP Problems Top 50 Graph Problems Top 50 Tree Problems Contests World Cup Hack-A-Thon GFG Weekly Coding Contest Job-A-Thon: Hiring Challenge BiWizard School Contest All Contests and Events GBlog Puzzles What\\'s New ? Change Language DSA Course DSA Interview Problems on Graph Practice Graph MCQs on Graph Graph Tutorial Graph Representation Graph Properties Types of Graphs Graph Applications BFS on Graph DFS on Graph Graph VS Tree Transpose Graph Dijkstra\\'s Algorithm Minimum Spanning Tree Prims Algorithm Topological Sorting Floyd Warshall Algorithm Strongly Connected Components Advantages & Disadvantages Sign In Open In App Introduction to Directed Acyclic Graph Last Updated : 23 Jul, 2025 Suggest changes Share Like Article Like Report A Directed Acyclic Graph , often abbreviated as DAG , is a fundamental concept in graph theory. DAGs are used to show how things are related or depend on each other in a clear and organized way. In this article, we are going to learn about Directed Acyclic Graph , its properties, and application in real life. Directed Acyclic Graph What is Directed Acyclic Graph? A Directed Acyclic Graph (DAG) is a directed graph that does not contain any cycles. Below Graph represents a Directed Acyclic Graph (DAG): Direct Acyclic Graph Meaning of Directed Acyclic Graph: Directed Acyclic Graph has two important features: Directed Edge s: In Directed Acyclic Graph, each edge has a direction, meaning it goes from one vertex (node) to another. This direction signifies a one-way relationship or dependency between nodes. Acyclic: The term \" acyclic \" indicates that there are no cycles or closed loops within the graph. In other words, you cannot traverse a sequence of directed edges and return to the same node, following the edge directions. Formation of cycles is prohibited in DAG. Hence this characteristic is essential. Directed Acyclic Graph Properties of Directed Acyclic Graph DAG: Directed Acyclic Graph (DAG) has different properties that make them usable in graph problems. There are following properties of Directed Acyclic Graph (DAG): Reachability Relation: In DAG, we can determine if there is a reachability relation between two nodes. Node A is said to be reachable from node B if there exists a directed path that starts at node B and ends at node A. This implies that you can follow the direction of edges in the graph to get from B to A. Transitive Closure: The transitive closure of a directed graph is a new graph that represents all the direct and indirect relationships or connections between nodes in the original graph. In other words, it tells you which nodes can be reached from other nodes by following one or more directed edges. Transitive Closure of Directed Acyclic Graph Transitive Reduction: The transitive reduction of a directed graph is a new graph that retains only the essential, direct relationships between nodes, while removing any unnecessary indirect edges. In essence, it simplifies the graph by eliminating edges that', 'images': [{'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20231019170926/dag6-660x478.jpeg', 'alt_text': 'dag6-660x478', 'width': '660', 'height': '478', 'confidence': 0.8999999999999999}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20231019164716/Untitled-Diagram-(2).png', 'alt_text': 'Untitled-Diagram-(2)', 'width': '501', 'height': '226', 'confidence': 0.8999999999999999}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20231106151300/1-(2).jpg', 'alt_text': '1-(2)', 'width': '1000', 'height': '500', 'confidence': 0.7}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20231106151411/2-(1).jpg', 'alt_text': '2-(1)', 'width': '1000', 'height': '500', 'confidence': 0.7}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20231106155309/3-(1).jpg', 'alt_text': '3-(1)', 'width': '1000', 'height': '500', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://medium.com/@dataproducts/step-by-step-process-to-building-directed-acyclic-graphs-dags-with-airflow-1bb41e352d15', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://object-oriented-python.github.io/9_trees_and_directed_acyclic_graphs.html', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://deepwiki.com/PacktPublishing/Causal-Inference-and-Discovery-in-Python/2.3-graphical-models-and-dags', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-08-07T18:52:22.250781",
      "end_time": "2025-08-07T18:54:03.347379",
      "execution_time": 101.096598,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T002",
      "description": "Generate a Python code example demonstrating the creation and manipulation of a DAG, including adding nodes, edges, and performing a topological sort. The code should be well-commented and demonstrate best practices.",
      "agent": "CoderAgent",
      "agent_prompt": "Generate a Python code example demonstrating the creation and manipulation of a DAG, including adding nodes, edges, and performing a topological sort. The code should be well-commented and demonstrate best practices. Ensure to include exception handling and comments for each functionality.",
      "reads": [
        "T001"
      ],
      "writes": [
        "T002"
      ],
      "status": "completed",
      "output": {
        "initial_thoughts": "Based on the prompt, I need to generate a Python code example that demonstrates the creation and manipulation of a Directed Acyclic Graph (DAG), including adding nodes, edges, and performing a topological sort. I'll use the `graphlib` module for this, ensuring proper exception handling and clear comments. I will add comments to make the code self explanatory.",
        "output": {},
        "call_self": false,
        "files": {
          "dag.py": "### Design Details: ###\n# This script demonstrates the creation and manipulation of a Directed Acyclic Graph (DAG) using the graphlib module.\n# It includes functionalities for adding nodes, edges, and performing a topological sort. The code is well-commented\n# and includes exception handling for robustness.\n\nimport graphlib\n\nclass DAG:\n    def __init__(self):\n        # Initialize the DAG with an empty dictionary to store dependencies.\n        # The keys are nodes, and the values are sets of their dependencies.\n        self.graph = {}\n\n    def add_node(self, node):\n        # Add a node to the DAG. If the node already exists, this is a no-op.\n        if node not in self.graph:\n            self.graph[node] = set()\n\n    def add_edge(self, from_node, to_node):\n        # Add a directed edge from from_node to to_node, indicating that to_node depends on from_node.\n        # If either node doesn't exist, it will be added to the graph.\n        if from_node not in self.graph:\n            self.add_node(from_node)\n        if to_node not in self.graph:\n            self.add_node(to_node)\n        self.graph[to_node].add(from_node)\n\n    def topological_sort(self):\n        # Perform a topological sort of the DAG.\n        # This returns a linear ordering of nodes such that for every directed edge from node A to node B,\n        # node A appears before node B in the ordering.\n        # Uses graphlib.TopologicalSorter for the sorting logic.\n        try:\n            ts = graphlib.TopologicalSorter(self.graph)\n            return list(ts.static_order())\n        except graphlib.CycleError as e:\n            # Handle the case where a cycle is detected in the graph, which prevents topological sorting.\n            raise ValueError(\"Cycle detected in the DAG: Topological sort not possible.\") from e\n\n\n# Example Usage:\nif __name__ == \"__main__\":\n    # Create an instance of the DAG.\n    dag = DAG()\n\n    # Add nodes to the DAG.\n    dag.add_node(\"A\")\n    dag.add_node(\"B\")\n    dag.add_node(\"C\")\n    dag.add_node(\"D\")\n    dag.add_node(\"E\")\n\n    # Add edges to define dependencies between the nodes.\n    dag.add_edge(\"A\", \"B\")  # B depends on A\n    dag.add_edge(\"A\", \"C\")  # C depends on A\n    dag.add_edge(\"B\", \"D\")  # D depends on B\n    dag.add_edge(\"C\", \"E\")  # E depends on C\n\n    # Attempt to perform a topological sort and print the sorted order.\n    try:\n        sorted_nodes = dag.topological_sort()\n        print(\"Topological Sort Order:\", sorted_nodes)\n    except ValueError as e:\n        # Handle any ValueErrors that occur during topological sorting, such as cycle detection.\n        print(f\"Error: {e}\")\n"
        },
        "cost": 0.001334025,
        "input_tokens": 6475.5,
        "output_tokens": 604.5,
        "total_tokens": 7080.0,
        "execution_result": {
          "status": "success",
          "session_id": "54592742",
          "operations": [
            "direct_files"
          ],
          "created_files": [
            "media\\generated\\54592742\\dag.py"
          ],
          "file_results": {
            "created_files": [
              "media\\generated\\54592742\\dag.py"
            ],
            "file_count": 1,
            "total_size": 2613,
            "status": "success",
            "errors": [],
            "execution_time": 0.009163799928501248
          },
          "code_results": {},
          "total_time": 0.01511069992557168,
          "error": null
        },
        "created_files": [
          "media\\generated\\54592742\\dag.py"
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-08-07T18:56:43.899247",
      "end_time": "2025-08-07T18:57:23.518922",
      "execution_time": 39.619675,
      "execution_result": {
        "status": "success",
        "session_id": "54592742",
        "operations": [
          "direct_files"
        ],
        "created_files": [
          "media\\generated\\54592742\\dag.py"
        ],
        "file_results": {
          "created_files": [
            "media\\generated\\54592742\\dag.py"
          ],
          "file_count": 1,
          "total_size": 2613,
          "status": "success",
          "errors": [],
          "execution_time": 0.009163799928501248
        },
        "code_results": {},
        "total_time": 0.01511069992557168,
        "error": null
      },
      "input_tokens": 0,
      "output_tokens": 0
    },
    {
      "id": "T003",
      "description": "Retrieve and explain SQL RIGHT JOIN, with a focus on syntax, use cases, and differences from other JOIN types. The response should be detailed and comprehensive.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Explain SQL RIGHT JOIN, with a focus on syntax, use cases, and differences from other JOIN types. Provide examples using different database dialects (e.g., PostgreSQL, MySQL). The explanation should be detailed and comprehensive.",
      "reads": [],
      "writes": [
        "T003"
      ],
      "status": "completed",
      "output": {
        "sql_right_join": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.programiz.com/sql/right-join', 'content': 'SQL RIGHT JOIN (With Examples) Learn DSA the way it should be with step-by-step code visualization. Learn DSA with step-by-step code visualization. Try now! Sale ends in Learn DSA the way it should be with step-by-step code visualization. Learn DSA with step-by-step code visualization. Try now! Sale ends in Tutorials Examples Courses Try Programiz PRO Course Index Tutorials Courses Python JavaScript TypeScript SQL HTML CSS C C++ Java R Ruby RUST Golang Kotlin Swift C# DSA Become a certified SQL programmer. ENROLL Popular Tutorials SQL SELECT SQL INSERT INTO SQL UPDATE SQL JOIN SQL GROUP BY Start Learning SQL Created with over a decade of experience. Learn Practice Compete Learn Python Learn HTML Learn JavaScript Learn SQL Learn DSA Learn C Learn C++ Learn Java View all Courses on Python Basics Python Intermediate C++ Basics C++ Intermediate C++ OOP C Programming Java Basics Java Intermediate Java OOP View all Courses on Python Challenges JavaScript Challenges Java Challenges C++ Challenges C Challenges View all Challenges on Learn Practice Compete Certification Courses Created with over a decade of experience and thousands of feedback. Learn Python Learn HTML Learn JavaScript Learn SQL Learn DSA View all Courses on Learn C Learn C++ Learn Java Python JavaScript TypeScript SQL HTML CSS C C++ Java More languages Become a certified SQL programmer. Try Programiz PRO! Popular Tutorials SQL SELECT SQL INSERT INTO SQL UPDATE SQL JOIN SQL GROUP BY Start Learning SQL All SQL Tutorials Python JavaScript C C++ Java R Kotlin Become a certified Python programmer. Try Programiz PRO! Popular Examples Add two numbers Check prime number Find the factorial of a number Print the Fibonacci sequence Check leap year All Python Examples Introduction Getting Started with SQL Introduction to Databases and SQL SQL SELECT(I) SQL SELECT SQL AND, OR, and NOT Operators SQL SELECT DISTINCT SQL SELECT AS Alias SQL SELECT LIMIT, TOP, FETCH FIRST SQL IN and NOT IN Operators SQL BETWEEN Operator SQL IS NULL and IS NOT NULL SQL MAX() and MIN() SQL COUNT() SQL SUM() AND AVG() SQL SELECT(II) SQL ORDER BY Clause SQL GROUP BY SQL LIKE and NOT LIKE Operators SQL Wildcards SQL UNION SQL Subquery SQL Views SQL CTE (Common Table Expressions) SQL ANY and ALL SQL CASE SQL HAVING Clause SQL EXISTS Operator SQL JOINS SQL JOINS SQL INNER JOIN SQL LEFT JOIN SQL RIGHT JOIN SQL FULL OUTER JOIN SQL CROSS JOIN SQL Self JOIN SQL Database and Table SQL CREATE DATABASE Statement SQL CREATE TABLE SQL DROP DATABASE Statement SQL DROP TABLE Statement SQL ALTER TABLE Statement SQL BACKUP DATABASE Statement SQL Insert, Update and Delete SQL INSERT INTO SQL UPDATE SQL SELECT INTO (Copy Table) SQL INSERT INTO SELECT Statement SQL DELETE and TRUNCATE SQL Constraints SQL Constraints SQL NOT NULL Constraint SQL UNIQUE Constraint SQL PRIMARY KEY Constraint SQL FOREIGN KEY Constraint SQL CHECK Constraint SQL DEFAULT Constraint SQL CREATE INDEX SQL Composite Key SQL Additional Topics SQL Comments SQL Data Types SQL Operators SQL Date and Time SQL JOIN Three Tables SQL SUBSTRING() SQL Commands SQL REPLACE() SQL REGEXP SQL Stored Procedures SQL Injection SQL Tutorials SQL FULL OUTER JOIN SQL JOIN Three Tables SQL INNER JOIN SQL LEFT JOIN SQL JOINS SQL CROSS JOIN SQL RIGHT JOIN The SQL RIGHT JOIN statement joins two tables based on a common column. It selects records that have matching values in these columns and the remaining rows from the right table. Example -- join Customers and Orders tables -- based on their shared customer_id columns -- Customers is the left table -- Orders is the right table SELECT Customers.customer_id, Customers.first_name, Orders.item FROM Customers RIGHT JOIN Orders ON Customers.customer_id = Orders.customer_id; Here, the code right joins the Customers and Orders tables based on customer_id , which is common to both tables. The result set contains customer_id and first_name columns from the Customers table item column from the Orders table (including those whose cust', 'images': [{'url': 'https://www.programiz.com/sites/tutorial2program/files/right-join-in-sql.png', 'alt_text': 'How to use RIGHT JOIN in SQL', 'title': 'SQL RIGHT JOIN Example', 'width': '600', 'height': '600', 'confidence': 0.8999999999999999}], 'rank': 1}, {'url': 'https://www.mysqltutorial.org/mysql-basics/mysql-right-join/', 'content': 'MySQL RIGHT JOIN Explained By Practical Examples Skip to content Home Start Here Basics Advanced Stored Procedures Triggers Events Views Indexes JSON Full-Text Search Administration Functions Aggregate Functions Comparison Functions Control Flow Functions Date Functions String Functions Window Functions Math Functions Regex Functions API PHP Python Node.js JDBC Perl TryIt Home MySQL Basics MySQL RIGHT JOIN MySQL RIGHT JOIN Summary : in this tutorial, you will learn how to use the MySQL RIGHT JOIN to query data from two tables. Introduction to MySQL RIGHT JOIN clause MySQL RIGHT JOIN is similar to LEFT JOIN , except that the treatment of the joined tables is reversed. Heres the syntax of the RIGHT JOIN of two tables t1 and t2 : SELECT select_list FROM t1 RIGHT JOIN t2 ON join_condition; Code language: SQL (Structured Query Language) ( sql ) In this syntax: The t1 is the left table and t2 is the right table. The join_condition specifies the rule for matching rows from both tables. If the join_condition uses the equal operator ( = ) and the joined columns of both tables have the same name, and you can use the USING syntax like this: SELECT select_list FROM t1 RIGHT JOIN t2 USING (column_name); Code language: SQL (Structured Query Language) ( sql ) Therefore, the following join conditions are equivalent: ON t1.column_name = t2.column_name Code language: SQL (Structured Query Language) ( sql ) and USING (column_name); Code language: SQL (Structured Query Language) ( sql ) How the RIGHT JOIN works. The RIGHT JOIN starts selecting data from the right table ( t2 ). It matches each row from the right table with every row from the left table. If both rows cause the join condition to evaluate to TRUE , the RIGHT JOIN combines columns of these rows into a new row and includes this new row in the result set. If a row from the right table does not have a matching row from the left table, the RIGHT JOIN combines columns of rows from the right table with NULL values for all columns of the right table into a new row and include this row in the result set. In other words, the RIGHT JOIN returns all rows from the right table regardless of having matching rows from the left table or not. Its important to emphasize that RIGHT JOIN and LEFT JOIN clauses are functionally equivalent, and they can replace each other as long as the table order is reversed. Notice that the RIGHT OUTER JOIN is a synonym for RIGHT JOIN . Therefore, you can use them interchangeably. MySQL RIGHT JOIN clause examples Well use the tables employees and customers from the sample database for the demonstration: The column salesRepEmployeeNumber in the table customers links to the column employeeNumber in the employees table. A sales representative, or an employee, may be in charge of zero or more customers. And each customer is taken care of by zero or one sales representative. If the value in the column salesRepEmployeeNumber is NULL, which means the customer does not have any sales representative. 1) Simple MySQL RIGHT JOIN example This statement uses the RIGHT JOIN clause join the table customers with the table employees . SELECT employeeNumber,   customerNumber FROM customers RIGHT JOIN employees ON salesRepEmployeeNumber = employeeNumber ORDER BY employeeNumber; Code language: SQL (Structured Query Language) ( sql ) In this example: The RIGHT JOIN returns all rows from the table employees whether rows in the table employees have matching values in the column salesRepEmployeeNumber of the table customers . If a row from the table employees has no matching row from the table customers , the RIGHT JOIN uses NULL for the customerNumber column. 2) Using MySQL RIGHT JOIN to find unmatching rows The following statement uses the RIGHT JOIN clause to find employees who are not in charge of any customers: SELECT employeeNumber,   customerNumber FROM customers RIGHT JOIN employees ON salesRepEmployeeNumber = employeeNumber WHERE customerNumber is NULL ORDER BY employeeNumber;', 'images': [{'url': 'https://www.mysqltutorial.org/wp-content/uploads/2019/08/MySQL-RIGHT-JOIN-example.png', 'alt_text': 'MySQL RIGHT JOIN example', 'width': '213', 'height': '162', 'class': 'wp-image-8164', 'confidence': 0.8999999999999999}, {'url': 'https://www.mysqltutorial.org/wp-content/uploads/2019/08/MySQL-RIGHT-JOIN-find-unmatching-rows.png', 'alt_text': 'MySQL RIGHT JOIN - find unmatching rows', 'width': '218', 'height': '174', 'class': 'wp-image-8165', 'confidence': 0.8999999999999999}], 'rank': 2}, {'url': 'https://hightouch.com/sql-dictionary/sql-right-join', 'content': 'SQL RIGHT JOIN - Syntax, Use Cases, and Examples | Hightouch Skip to main content Snowflake Ventures & Capital One Ventures invest in Hightouch to bring AI agents to marketers Copy .SVG Brand assets Press Platform Composable CDP Customer Studio Build audiences Reverse ETL Sync data Identity Resolution Stitch users together Hightouch Events Collect data Real-time Personalization Dynamic digital experiences Match Booster Increase ad match rates Campaign Intelligence Analyze campaigns AI Decisioning AI agents Deliver 1:1 experiences at scale Reinforcement learning Continuous optimization Insights Uncover new opportunities Enterprise-ready platform features Enterprise-level security Enterprise-level security with SOC 2 Type 2 and ISO 27001 certification Observability Full transparency and control to monitor and troubleshoot Governance & access control Robust access control and change management Solutions By team Marketing Advertising Data Operations By industry Retail & eCommerce Media & Entertainment Financial Services Healthcare B2B SaaS For marketing Audience segmentation Journey orchestration Real-time personalization Profile enrichment Customer 360 For advertising Audience targeting Audience suppression Conversion tracking Match rate boosting Featured Learn about the benefits of a Composable CDP and how it compares to a traditional CDP solution Learn more Integrations All integrations Integration catalog Hightouch integrates with 250+ tools spanning Advertising, Marketing Automation, CRMs, Customer Success, and more See all 250+ integrations Popular sources Snowflake Databricks Google BigQuery AWS Redshift Azure Synapse See all sources Popular destinations Salesforce HubSpot Google Ads Facebook Ads Iterable See all destinations Popular extensions dbt Sigma Looker Fivetran Customers Resources Explore Blog Learn Whitepapers & guides Playbooks Lifecycle Leaders newsletter CDP Comparisons Documentation Core concepts Understand the basics of how Hightouch works Syncs Syncs define how you want to get data from your source to destination Models Hightouch models define and organize data from a source Read our docs Get started Talk to us Schedule 30-minutes to talk through how to solve your use cases Events Find conferences, local events, and webinars to learn more Solutions partners Our Partners design, build and deliver exceptional data solutions Featured The complete guide to Composable Customer Data Platforms Download the whitepaper Pricing Log in Get a demo SQL Dictionary Joins SQL RIGHT JOIN What is SQL RIGHT JOIN? SQL RIGHT JOIN, also known as a RIGHT OUTER JOIN, is a type of SQL JOIN operation that retrieves all records from the right table (table2) and the matching records from the left table (table1). If there are no matching records in the left table, NULL values are included for those columns. When you would use it You would use a SQL RIGHT JOIN when you want to retrieve all the records from one table (the right table) and only the matching records from a related table (the left table). Common use cases for RIGHT JOIN include: Displaying all items: When you want to display all items from the right table, even if there are no corresponding items in the left table. Handling missing data: When you need to handle situations where data might be missing or incomplete in one of the tables. Optional relationships: In scenarios where relationships between tables are optional, and you still want to display data from the secondary table. Combining data: When you want to combine data from multiple tables while preserving all records from one of the tables. Syntax The syntax for a SQL RIGHT JOIN operation is as follows: SELECT column_list FROM table1 RIGHT JOIN table2 ON table1.column = table2.column; column_list : A list of columns to retrieve from the joined tables. table1 and table2 : The names of the tables to be joined. column : The common column or key that relates the tables. Parameter values column_list : A list of column nam', 'images': [{'url': 'https://hightouch.com/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fposter.ec79885a.png&w=3840&q=75&dpl=dpl_A4zhJuMLfiwz5gksLydJrCZbiWKA', 'alt_text': 'Hightouch Audiences user interface.', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://www.geeksforgeeks.org/sql/sql-join-set-1-inner-left-right-and-full-joins/', 'content': \"SQL Joins (Inner, Left, Right and Full Join) - GeeksforGeeks Skip to content Courses DSA to Development GATE 2026 Prep Get 3 IBM Certifications For Working Professionals Interview 101: DSA & System Design JAVA Backend Development (Live) Data Analytics Training DevOps Engineering (LIVE) DSA in Python For Students Placement Preparation with DSA Data Science (Live) DSA Self Paced (C++/JAVA) Master Competitive Programming Full Stack Development with React & Node JS (Live) Full Stack Development Data Science & ML Program All Courses Tutorials Python Java DSA ML & Data Science Interview Corner Programming Languages Web Development GATE CS Subjects DevOps School Learning Software and Tools Practice Practice Coding Problems Nation Skillup- Free Courses Problem of the Day Jobs Become a Mentor Apply Now! Post Jobs Job-A-Thon: Hiring Challenge Notifications Mark all as read All View All Notifications Mark all as read All Unread Read You're all caught up!! Databases SQL MySQL PostgreSQL PL/SQL MongoDB SQL Cheat Sheet SQL Interview Questions MySQL Interview Questions PL/SQL Interview Questions Learn SQL and Database Sign In Open In App Explore GfG Courses Share Your Experiences SQL Tutorial Basics What is SQL? SQL Data Types SQL Operators SQL Commands | DDL, DQL, DML, DCL and TCL Commands SQL Database Operations SQL CREATE TABLE Queries & Operations SQL SELECT Query SQL INSERT INTO Statement SQL UPDATE Statement SQL DELETE Statement SQL | WHERE Clause SQL | Aliases SQL Joins & Functions SQL Joins (Inner, Left, Right and Full Join) SQL CROSS JOIN SQL | Date Functions (Set-1) SQL | String functions Data Constraints & Aggregate Functions SQL NOT NULL Constraint SQL PRIMARY KEY Constraint SQL Count() Function SQL SUM() Function SQL MAX() Function AVG() Function in SQL Advanced SQL Topics SQL Subquery Window Functions in SQL SQL Stored Procedures SQL Triggers SQL Performance Tuning SQL TRANSACTIONS Database Design & Security Introduction of ER Model Introduction to Database Normalization SQL Injection SQL Data Encryption SQL Backup What is Object-Relational Mapping (ORM) in DBMS? DSA to Development Course SQL Joins (Inner, Left, Right and Full Join) Last Updated : 02 Aug, 2025 Comments Improve Suggest changes Like Article Like Report SQL joins are fundamental tools for combining data from multiple tables in relational databases. For example, consider two tables where one table (say Student) has student information with id as a key and other table (say Marks) has information about marks of every student id. Now to display the marks of every student with name, we need to join the two tables. Please remember, we store data into multiple tables as part of database normalization to avoid anomalies and redundancies. Types of SQL Joins Let us visualize how each join type operates: 1. SQL INNER JOIN The INNER JOIN keyword sele cts all rows from both the tables as long as the condition is satisfied. This keyword will create the result set by combining all rows from both the tables where the condition satisfies i.e value of the common field will be the same. Syntax: SELECT table1.column1,table1.column2,table2.column1,.... FROM table1 INNER JOIN table2 ON table1.matching_column = table2.matching_column; Note : We can also write JOIN instead of INNER JOIN. JOIN is same as INNER JOIN. Inner Join Example of INNER JOIN Consider the two tables, Student and StudentCourse, which share a common column ROLL_NO . Using SQL JOINS, we can combine data from these tables based on their relationship, allowing us to retrieve meaningful information like student details along with their enrolled courses. 1. Student Table: Student 2. StudentCourse Table: StudentCourse Let's look at the example of INNER JOIN clause, and understand it's working. This query will show the names and age of students enrolled in different courses. Query: SELECT StudentCourse.COURSE_ID, Student.NAME, Student.AGE FROM Student INNER JOIN StudentCourse ON Student.ROLL_NO = StudentCourse.ROLL_NO; O\", 'images': [{'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20250607125936039070/Student_table.webp', 'alt_text': 'Student_table', 'width': '640', 'height': '318', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20250607130103043174/StudentCourse_Table.webp', 'alt_text': 'StudentCourse_Table', 'width': '361', 'height': '310', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20250607130329956913/Example_innerjoin.webp', 'alt_text': 'Example_innerjoin', 'width': '546', 'height': '208', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20250607130804622355/example_rightjoin.webp', 'alt_text': 'example_rightjoin', 'width': '361', 'height': '316', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://media.geeksforgeeks.org/wp-content/uploads/20250607125822884856/SQL-Join.webp', 'alt_text': 'SQL-Join', 'width': '502', 'height': '329', 'confidence': 0.7}], 'rank': 4}, {'url': 'https://www.slingacademy.com/article/postgresql-using-right-join-to-join-multiple-tables/', 'content': \"PostgreSQL: Using RIGHT JOIN to join multiple tables - Sling Academy Menu Home JvaScript Node.js Next.js Flutter Swift NestJS Python PyTorch Sample Data FastAPI PostgreSQL MySQL MongoDB Mongoose SQLAlchemy Sling Academy Dark Mode is ON PostgreSQL Tutorials Setup PostgreSQL Setup PostgreSQL Mac Setup PostgreSQL PostgreSQL vs MySQL SQL vs NoSQL Speed Add/Delete Users in PG Reset PG Password Reset PG Password Mac Reset PGSQL Password PostgreSQL Users & Permissions Drop DB in PostgreSQL List PGSQL Databases PostgreSQL Import/Export View DB Size in PG Change PG Password PGSQL Permissions PGSQL Auto-Backup Auto-Backup in PostgreSQL MySQL to PostgreSQL PgSQL Data Migration PG Conditional Table Delete Table in PgSQL Alter Table in PgSQL Rename PGSQL Column Modify PSQL Table Drop Table in Postgres Viewing PG Tables PostgreSQL Indexing Unique Constraints Unsigned Int in PGSQL Insert in PostgreSQL Bulk Insert PostgreSQL Inserting Quotes Set Column Default PostgreSQL Timestamps Timestamp Comparisons Add NOT NULL in SQL PostgreSQL 'Returning' Update Row in Postgres Bulk Update/Delete PG Delete & Return Row PgSQL Upsert Guide Select Rows in Postgres Select by ID in SQL PGSQL OFFSET & LIMIT Select Distinct Rows Random Row in Postgres Random Rows in SQL Using WHERE in SQL PostgreSQL Aliases PostgreSQL ORDER BY IN & NOT IN in SQL FETCH & OFFSET SQL BETWEEN in PostgreSQL LIKE & ILIKE in SQL IS NULL in Postgres PGSQL String Concat PG: CONCAT & CONCAT_WS PostgreSQL JSON PostgreSQL: Categories in One Table Reset PostgreSQL Auto-Increment CHAR vs. VARCHAR vs. TEXT Storing Nested Comments in SQL PostgreSQL Boolean NUMERIC & DECIMAL in PgSQL PostgreSQL DATE & TIME PostgreSQL TIMESTAMPs UUIDs in PostgreSQL PostgreSQL Arrays PostgreSQL Data Types PgSQL CAST & :: Drop FOREIGN KEY Constraints PGSQL Data Convert PGSQL: to_char/to_number PGSQL: Date/Time Func Use ENUM in PostgreSQL PGSQL ENUM Defaults PostgreSQL DOMAINS Custom Types in PG PostgreSQL ALTER TYPE Custom Collations & Types in PostgreSQL PostgreSQL FOREIGN KEY CHECK in PostgreSQL No PK in PostgreSQL Text PK in Postgres Drop Constraint in SQL Update Foreign Key PostgreSQL Sequences PostgreSQL Sequences PostgreSQL Sequences PGSQL: Sequences Descending Sequences Delete PG Sequence PSQL Column Sequence List PG Sequences Share Sequence PGSQL Alphanumeric Seq PG PG String Functions LEFT & RIGHT in SQL REVERSE in PostgreSQL SPLIT_PART in SQL PostgreSQL TRIM LPAD & RPAD in SQL Removing Old PostgreSQL Indices PostgreSQL LENGTH PostgreSQL Temp Tables PGSQL: Weighted Random Selection REINDEX in PostgreSQL Guide Combine Data from 2 Tables in PG POSITION in PGSQL STRPOS in PostgreSQL PostgreSQL CLI Cheat Sheet PostgreSQL SUBSTRING REPEAT in PostgreSQL PostgreSQL REPLACE Regex in PostgreSQL COUNT in PostgreSQL PostgreSQL COUNTs PostgreSQL Aggregates PostgreSQL: GREATEST/LEAST Cursor-based Pagination in PgSQL PgSQL Math Columns Storing Images in PostgreSQL Table Structure in SQL PostgreSQL Time I/O Date Conversion in SQL TO_TIMESTAMP Guide Format Dates in SQL PGSQL Date Functions MAKE_INTERVAL Guide MAKE_TIMESTAMPTZ Date Extractors PgSQL Date Math in Postgres PostgreSQL OVERLAPS AGE Function in PgSQL PostgreSQL Date/Time Date Accuracy with EPOCH Check PG Timezone PostgreSQL NOW() & CURRENT_TIMESTAMP PostgreSQL Date Funcs PostgreSQL GROUP BY Group Rows in Postgres PGSQL Aggregations HAVING in PostgreSQL Query Dates in SQL PGSQL LEFT JOIN PostgreSQL RIGHT JOIN PGSQL INNER JOIN FULL JOIN in PgSQL SQL Table Joins Self Joins in SQL CROSS Joins in SQL Append Tables in SQL PostgreSQL: Combine PG Schema Ops PGSchema Hierarchy PostgreSQL Logs Granting Privileges SELECT INTO in PgSQL Import/Export CSV Table Size in PGSQL PostgreSQL: Calculated Columns PostgreSQL Fixed-Size Tables PostgreSQL Privileges Postgres live/dead rows Postgres cmd history Essential psql Commands PostgreSQL Cursors Create PGSQL Trigger Data Audit in PSGL View PGSQL Triggers PostgreSQL TRIGGERS PostgreSQL Conditions PostgreSQL Triggers Drop Trigg\", 'images': [], 'rank': 5}, {'url': 'https://www.w3schools.com/mysql/mysql_join_right.asp', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.sparkcodehub.com/sql/data-manipulation/right-join', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://sqlqueries.in/sql-joins-with-examples-complete-guide-updated-2020/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-08-07T18:54:08.358755",
      "end_time": "2025-08-07T18:55:23.327185",
      "execution_time": 74.96843,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T004",
      "description": "Generate an SQL query example demonstrating RIGHT JOIN using sample tables. Include comments explaining the logic. The example should showcase a practical use case.",
      "agent": "CoderAgent",
      "agent_prompt": "Generate an SQL query example demonstrating RIGHT JOIN using sample tables named 'employees' and 'departments'. Include comments explaining the logic of the query. The example should showcase a practical use case where RIGHT JOIN is useful for identifying departments without any employees.",
      "reads": [
        "T003"
      ],
      "writes": [
        "T004"
      ],
      "status": "completed",
      "output": {
        "initial_thoughts": "I need to generate an SQL query demonstrating a RIGHT JOIN between 'employees' and 'departments' tables, highlighting its use in identifying departments without employees. I'll ensure the query is well-commented for clarity.",
        "output": {},
        "call_self": false,
        "files": {
          "right_join_example.sql": "-- SQL query to demonstrate RIGHT JOIN\n-- This query identifies departments that have no employees.\n\n-- Sample tables (you can create these in your SQL environment)\n-- Table: employees\n-- Columns: employee_id (INT, PRIMARY KEY), employee_name (VARCHAR), department_id (INT, FOREIGN KEY referencing departments.department_id)\n\n-- Table: departments\n-- Columns: department_id (INT, PRIMARY KEY), department_name (VARCHAR)\n\nSELECT\n    d.department_name,\n    COUNT(e.employee_id) AS employee_count\nFROM\n    departments d\nRIGHT JOIN\n    employees e ON d.department_id = e.department_id\nGROUP BY\n    d.department_name\nHAVING\n    COUNT(e.employee_id) = 0;\n\n-- Explanation:\n-- 1. The RIGHT JOIN ensures that all departments are included in the result, even if they don't have any employees.\n-- 2. The ON clause specifies the join condition: matching department_id in both tables.\n-- 3. COUNT(e.employee_id) counts the number of employees in each department. If a department has no employees, this count will be 0.\n-- 4. GROUP BY d.department_name groups the results by department name to allow for the count.\n-- 5. HAVING COUNT(e.employee_id) = 0 filters the results to only show departments with no employees."
        },
        "cost": 0.0014456249999999999,
        "input_tokens": 8455.5,
        "output_tokens": 295.5,
        "total_tokens": 8751.0,
        "execution_result": {
          "status": "success",
          "session_id": "54592742",
          "operations": [
            "direct_files"
          ],
          "created_files": [
            "media\\generated\\54592742\\right_join_example.sql"
          ],
          "file_results": {
            "created_files": [
              "media\\generated\\54592742\\right_join_example.sql"
            ],
            "file_count": 1,
            "total_size": 1202,
            "status": "success",
            "errors": [],
            "execution_time": 0.0062368998769670725
          },
          "code_results": {},
          "total_time": 0.013246800052002072,
          "error": null
        },
        "created_files": [
          "media\\generated\\54592742\\right_join_example.sql"
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-08-07T18:57:28.564230",
      "end_time": "2025-08-07T18:58:04.169679",
      "execution_time": 35.605449,
      "execution_result": {
        "status": "success",
        "session_id": "54592742",
        "operations": [
          "direct_files"
        ],
        "created_files": [
          "media\\generated\\54592742\\right_join_example.sql"
        ],
        "file_results": {
          "created_files": [
            "media\\generated\\54592742\\right_join_example.sql"
          ],
          "file_count": 1,
          "total_size": 1202,
          "status": "success",
          "errors": [],
          "execution_time": 0.0062368998769670725
        },
        "code_results": {},
        "total_time": 0.013246800052002072,
        "error": null
      },
      "input_tokens": 0,
      "output_tokens": 0
    },
    {
      "id": "T005",
      "description": "Retrieve and explain how to automate disk space monitoring using a bash script, covering essential commands and techniques. The response should be detailed and comprehensive.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Explain how to automate disk space monitoring using a bash script, covering essential commands like `df`, `du`, and techniques for sending alerts when disk space is low. Provide detailed explanation. Focus on practical aspects and include examples of how to format the output for readability.",
      "reads": [],
      "writes": [
        "T005"
      ],
      "status": "completed",
      "output": {
        "data": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.cyberciti.biz/tips/shell-script-to-watch-the-disk-space.html', 'content': '[error] Timeout while extracting content', 'rank': 1}, {'url': 'https://www.2daygeek.com/shell-script-monitor-disk-space-usage-linux/', 'content': 'Linux Shell Script To Monitor Disk Space Usage And Send Email | 2DayGeek Skip to content Top Menu August 8, 2025 Home About Contact Us OS Tweak Icons Themes Sitemap Linux Acronyms Facebook Twitter Linkedin Tumblr Pinterest 2DayGeek Linux and Unix, Open Source, Linux Howtos Main Menu Home Shell Script LVM Ansible Posts Archive Package Management Linux Commands Monitoring Tools Search for: Bash Script / Linux Administration / Linux Basic / Shell Script How to monitor disk space usage with shell script May 1, 2019 July 22, 2021 - by Magesh Maruthamuthu - 15 Comments. Share Tweet Pin It Share It is an important task for Linux administrators to monitor disk space usage on any system thats used for hosting critical applications, in order to prevents the system from becoming unresponsive or get into an unknown problem. There are various monitoring tools available that monitor everything, and trigger an email when the system reaches a given threshold. However, it is suitable for small and large environments, but what is the best approach if you only have a few systems? In this case, it is better to write a shell script based on what you need to monitor in your environment. We have included three shell scripts below and you can choose the one that suits your need. These scripts will trigger an email to the corresponding email id when the system reaches a given threshold. Refer to this article (embedded link), If you are looking for a bash script to monitor disk space usage on multiple remote Linux systems . Make a note: When using df -h in the shell script in some distributions, you may end up with the below error message as the output is not in the correct format. Use df -Ph (POSIX output format) to deal with this problem. # sh /opt/script/disk-usage-alert-old.sh /dev/mapper/vg_2g-lv_root test-script.sh: line 7: [: /dev/mapper/vg_2g-lv_root: integer expression expected / 9.8G Method-1: Shell script to monitor disk space usage in Linux This script is very simple and straightforward, which triggers an email when the system reaches a given threshold. In this example, we set threshold at 60% for testing purpose and you can change this limit based on your requirements. Be sure to include your email ID in the script. # vi /opt/script/disk-usage-alert.sh #!/bin/sh dusage=$(df -Ph | grep -vE \\'^tmpfs|cdrom\\' | sed s/%//g | awk \\'{ if($5 > 60) print $0;}\\') fscount=$(echo \"$dusage\" | wc -l) if [ $fscount -ge 2 ]; then echo \"$dusage\" | mail -s \"Disk Space Alert On $(hostname) at $(date)\" [emailprotected] else echo \"Disk usage is in under threshold\"  fi Set an executable permission to the file disk-usage-alert.sh : # chmod +x /opt/script/disk-usage-alert.sh Run the following script to see if it works as expected: # sh /opt/script/disk-usage-alert.sh Sampleemail alert: You will receive an email alert similar to the one below. Filesystem              Size Used Avail Use Mounted on /dev/mapper/vg_2g-lv_root       10G 6.7G 3.4G 67 / /dev/mapper/vg_2g-lv_home       5.0G 4.3G 784M 85 /home Finally add a cronjob to automate this as shown below. It will run every 10 minutes. # crontab -e */10 * * * * /bin/bash /opt/script/disk-usage-alert.sh Note: As the script is scheduled to run once every 10 minutes, you will receive an email alert every 10 minutes. For example: if your system reaches the given limit after 16 minutes, you will receive an email alert in the second cycle, i.e. after 20 minutes (2nd 10 minute cycle). Method-2: Monitoring disk space usage with shell script Alternatively, the following shell script can be used to monitor disk space usage on Linux systems. This script send multiple emails if more than one file system reaches the given threshold limit, as the script is uses a loop (notice the do logic below): # vi /opt/script/disk-usage-alert-1.sh #!/bin/sh df -Ph | grep -vE \\'^Filesystem|tmpfs|cdrom\\' | awk \\'{ print $5,$1 }\\' | while read output; do  echo $output  used=$(echo $output | awk \\'{print $1}\\' | se', 'images': [{'url': 'https://www.2daygeek.com/wp-content/uploads/2024/12/how-to-create-users-using-shell-script-in-linux-348x215.png', 'alt_text': 'How to Create Users using Shell Script in Linux', 'width': '348', 'height': '215', 'class': 'attachment-hitmag-grid size-hitmag-grid wp-post-image', 'confidence': 0.8999999999999999}, {'url': 'https://www.2daygeek.com/wp-content/uploads/2023/07/map-san-lun-physical-disk-filesystem-lvm-info-linux-348x215.png', 'alt_text': 'Mapping SAN LUN, Disk, LVM and FS in Linux', 'width': '348', 'height': '215', 'class': 'attachment-hitmag-grid size-hitmag-grid wp-post-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 2}, {'url': 'https://www.consolebear.com/2024/07/09/receive-disk-space-alerts-with-a-simple-bash-script/', 'content': 'Bash Script for Real-Time Disk Space Alerts Sent to Your Inbox | Console Bear Home Dev DevOps SysOps CyberSec Tips and Tricks Contact Select Page Bash Script for Real-Time Disk Space Alerts Sent to Your Inbox by Console Bear | Jul 9, 2024 | All , DevOps , Linux , SysOps , Tips and Tricks | 0 comments Running out of disk space can cause significant issues, including system crashes and data loss. This Bash script monitors the disk space usage of a specified directory and sends an email alert if the usage exceeds a defined threshold. Step-by-Step Guide : 1. Define Variables : Set the threshold percentage for disk usage and the email address to receive alerts. THRESHOLD=80 EMAIL= \"your_email@example.com\" 2. Check Disk Usage : Use the df command to get the disk usage of the specified directory. DISK_USAGE=$( df /path/to/directory | grep / | awk \\'{ print $5 }\\' | sed \\'s/%//g\\' ) 3. Send an Email Alert : If the disk usage exceeds the threshold, send an email alert. if [ $DISK_USAGE -gt $THRESHOLD ]; then echo \"Disk space warning: $DISK_USAGE % used\" | mail -s \"Disk Space Alert\" $EMAIL fi Complete Script : #!/bin/bash # Variables THRESHOLD=80 EMAIL= your_email@example.com DISK_USAGE=$( df /path/to/directory | grep / | awk { print $5 } | sed s/%//g ) # Check disk usage if [ $DISK_USAGE -gt $THRESHOLD ]; then echo Disk space warning: $DISK_USAGE % used | mail -s Disk Space Alert $EMAIL fi Usage : Replace /path/to/directory with the directory to monitor. Set THRESHOLD to the desired percentage. Replace your_email@example.com with your email address. Save it to .sh file (ie. diskspacealert.sh) and run it periodically with a crontab This script ensures you are promptly notified if your disk space is running low, allowing you to take action before it becomes a critical issue. Submit a Comment Cancel reply You must be logged in to post a comment. Facebook ConsoleBear.com 2019-2024', 'images': [], 'rank': 3}, {'url': 'https://medium.com/@aardvarkinfinity/disk-usage-monitoring-and-alerting-with-bash-scripting-and-df-36a63c577983', 'content': 'Disk Usage Monitoring and Alerting with Bash Scripting and df | by Aardvark Infinity | Medium Sitemap Open in app Sign up Sign in Medium Logo Write Sign up Sign in Disk Usage Monitoring and Alerting with Bash Scripting and df Aardvark Infinity 2 min read Mar 30, 2024 -- Listen Share www.gerardking.dev Author: Gerard King Senior Technology Consultant and Cybersecurity Strategist Toronto, ON | gerardakingiii@gmail.com | 4165791818 | www.gerardking.dev Description: This production-ready Bash script monitors disk usage on your server using df . It calculates the percentage of used space on designated partitions and triggers email alerts if thresholds are breached. This proactive approach empowers you to identify potential storage bottlenecks and take corrective actions before critical system functions are impacted, demonstrating high value to your core large investors. Benefits for Investors: Early Warning System: Timely alerts allow for proactive management of disk space and prevent system slowdowns. Improved System Performance: Monitoring disk usage facilitates informed decisions on storage allocation and optimization strategies. Reduced Downtime: Identifying potential disk space exhaustion minimizes the risk of system crashes. Enhanced Resource Management: Script empowers proactive measures to ensure adequate storage availability for critical applications. Requirements: Bash shell df command-line tool mail command-line tool (or an alternative mail sending utility) Installation: Save the script as disk_monitor.sh . Modify the script variables to reflect your environment: PARTITIONS (Comma-separated list of partitions to monitor (e.g., /, /var, /home)) WARNING_THRESHOLD (Disk usage percentage to trigger a warning email) CRITICAL_THRESHOLD (Disk usage percentage to trigger a critical alert email) RECIPIENT_EMAIL (Email address for notifications) Make the script executable: chmod +x disk_monitor.sh . Script: Bash #!/bin/bash # Partitions to monitor (adjust as needed) PARTITIONS=\"/ /var /home\" # Warning threshold (disk usage percentage) WARNING_THRESHOLD=80 # Critical threshold (disk usage percentage) CRITICAL_THRESHOLD=90 # Recipient email address RECIPIENT_EMAIL=\"youremail@example.com\" # Function to send email alert send_email_alert() { partition=\"$1\" usage=\"$2%\" severity=\"$3\" subject=\"Disk Usage Alert: $severity - $partition ($usage)\" body=\"The disk usage on partition $partition has reached $usage. Please investigate and free up space if necessary.\" echo -e \"$body\" | mail -s \"$subject\" \"$RECIPIENT_EMAIL\" } # Monitor disk usage on specified partitions for partition in $PARTITIONS; do usage=$(df -h --output=pcent \"$partition\" | tail -n 1 | awk \\'{print $1}\\') usage=${usage%?} # Remove trailing \"%\" character if [[ $usage -ge $CRITICAL_THRESHOLD ]]; then send_email_alert \"$partition\" \"$usage\" \"Critical\" elif [[ $usage -ge $WARNING_THRESHOLD ]]; then send_email_alert \"$partition\" \"$usage\" \"Warning\" fi done echo \"Disk usage monitoring script complete.\" Important Notes: Consider customizing the script to monitor additional system resources beyond disk space. Explore integrating the script with scheduling tools for periodic monitoring and report generation. Review your email server configuration to ensure the script can send email notifications successfully. By implementing this script, I have effectively showcased myexpertise in system resource management and proactive monitoring practices. It demonstrates a high-value solution for my core large investors by ensuring optimal disk space utilization and preventing potential performance bottlenecks. Remember to adjust the script variables, test it thoroughly, and consider scheduling it for regular disk usage monitoring. Disk Usage Script Bash Script Gerard King Cybersecurity Linux -- -- Written by Aardvark Infinity 657 followers 8 following Welcome to Aardvark Infinity Embark on a journey to the future with cutting-edge technology. No responses yet Help Status About Careers Press Blog Pri', 'images': [], 'rank': 4}, {'url': 'https://tecadmin.net/shell-script-to-check-disk-space-and-send-alert/', 'content': 'Shell Script to Monitor Disk Space and Send Alert TecAdmin We use cookies to improve your experience, analyze traffic, and for advertising purposes. Please select your preferences: Analytics (e.g., site usage statistics) Ads Storage (e.g., ad measurement, demographics) Ad User Data (e.g., ad measurement, audience remarketing) Ad Personalization (e.g., personalized ads, audience remarketing) Save Preferences Accept All Decline All Learn More Close Menu Facebook X (Twitter) Instagram Thursday, August 7 Home FeedBack Submit Article About Us About Us Submit Article Donate to Charity FeedBack/Grievance Sitemap Privacy Policy Term Of Services Shell Script to Monitor Disk Space and Send Alert By Rahul April 26, 2025 6 Mins Read It is essential to monitor the disk space on a Linux server to ensure enough free space is available for new files and applications. If the disk becomes full, it can cause issues such as system crashes, data loss, and other problems. To prevent these issues, you can use a shell script to monitor the disk space and send an alert when the available space falls below a certain threshold. In this article, we will walk through the process of creating a shell script that monitors the disk space and sends an alert when the available space falls below a certain threshold. We will use the df command to check the available disk space and the mail command to send the alert. The features of this script are: This script can check available free space for multiple disks You can enable to send an email notification You can set the threshold values for Warning and Critical conditions Accept inputs as command line parameters Step 1: Shell Script to Check Disk Space I have written this shell script that is capable of checking for the available free space on given disks and notifying the admin if the disk space is low. This script required a Bash shell to run. First copy the shell script on your Linux system. In the next steps, I will provide instructions on how to execute it. Download this script from GitHub: https://github.com/tecrahul/shell-scripts/blob/master/check-disk-space/check_disk_space.sh Otherwise copy the below shell script and paste it to a file on your server. #/usr/bin/env bash ######################################################################### ######################################################################### # # This shell script checks for free disk space for defined disks and send # email alert based on threshold defined for warning and critical emails # # Warning and critical thresholds can be passed as command-line parameters # The command can be run as: # # \"bash /path/to/script.sh -w 20 -c 10 -d /dev/sda1 -d /\" # # The above script will check free space on /dev/sda1 and disk # mounted on the root (/) file system. The script will send a Warning alert # if free space is less than 20% of available space and a Critical alert # will be sent if free space is less than 10%. # #  Default warning alert threshold: 20% #  Default critical alert threshold: 10% #  Default disk to check: / # ######################################################################### ######################################################################### ### initializing variables ## To enable email notification set ENABLE_EMAIL_ALERT to 1 ENABLE_EMAIL_ALERT=1 NOTIFICATION_EMAIL=\" [emailprotected] \" ## Uncomment and set a custom hostname, default uses the system\\'s hostname #HOSTNAME=\"web-server1\"  ## Other variables required for the script THRESHOLD_WARNING=20   #In percent THRESHOLD_CRITICAL=10  #In percent WARNING=0 CRITICAL=0 WARNING_ALERT=0 CRITICAL_ALERT=0 ### Create a temporary file to compose an email mail_content=`mktemp`  ### Read the command line parameters while getopts \":w:c:d:\" option; do   case ${option} in     w)       THRESHOLD_WARNING=${OPTARG}       ;;     c)       THRESHOLD_CRITICAL=${OPTARG}       ;;     d)       set -f       disks+=($', 'images': [], 'rank': 5}, {'url': 'https://stackoverflow.com/questions/16708242/bash-script-that-monitor-a-disk-partitions-usage', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.linuxbash.sh/post/monitoring-disk-usage-with-bash-commands', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://linuxopsys.com/shell-script-to-check-disk-space', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-08-07T18:55:28.354140",
      "end_time": "2025-08-07T18:56:38.867348",
      "execution_time": 70.513208,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T006",
      "description": "Generate a bash script that automates disk space monitoring, including sending alerts when disk space is low. The script should be well-commented and demonstrate error handling.",
      "agent": "CoderAgent",
      "agent_prompt": "Generate a bash script that automates disk space monitoring, including sending alerts when disk space is low. The script should be well-commented, demonstrate error handling, and include configuration options for setting thresholds and alert recipients. Also, make sure to include detailed explanation about how to make the script execute in background using & or nohup.",
      "reads": [
        "T005"
      ],
      "writes": [
        "T006"
      ],
      "status": "completed",
      "output": {
        "initial_thoughts": "Okay, I need to create a bash script that monitors disk space and sends alerts. I'll incorporate error handling, configuration options for thresholds and recipients, and instructions for running the script in the background. The search results provide good examples I can adapt.",
        "output": {},
        "call_self": false,
        "files": {
          "disk_space_monitor.sh": "#!/bin/bash\n\n# Description: This script monitors disk space usage and sends alerts when thresholds are exceeded.\n# Author: CoderAgent\n# Date: October 26, 2023\n\n# Configuration section\nTHRESHOLD_WARNING=80  # Warning threshold (percentage)\nTHRESHOLD_CRITICAL=95 # Critical threshold (percentage)\nRECIPIENT_EMAIL=\"[email protected]\" # Email address to send alerts to\nLOG_FILE=\"/var/log/disk_space_monitor.log\" # Log file location\n\n# Function to send email alert\nsend_alert() {\n  SUBJECT=\"Disk Space Alert: $(hostname) - $1\"\n  BODY=\"Disk: $2\\nUsage: $3%\\nThreshold: $1\"\n  echo \"$BODY\" | mail -s \"$SUBJECT\" \"$RECIPIENT_EMAIL\"\n  echo \"$(date) - ALERT: $SUBJECT - $BODY\" >> \"$LOG_FILE\"\n}\n\n# Function to check disk space\ncheck_disk_space() {\n  df -h | grep -vE '^Filesystem|tmpfs|cdrom' | awk '{print $5 \" \" $6}' | while read -r usage mount_point; do\n    usage_percent=$(echo $usage | sed 's/%//g')\n\n    if [[ \"$usage_percent\" -ge \"$THRESHOLD_CRITICAL\" ]]; then\n      send_alert \"Critical\" \"$mount_point\" \"$usage_percent\"\n    elif [[ \"$usage_percent\" -ge \"$THRESHOLD_WARNING\" ]]; then\n      send_alert \"Warning\" \"$mount_point\" \"$usage_percent\"\n    fi\n  done\n}\n\n# Main script logic\ncheck_disk_space\n\n# Log the execution\necho \"$(date) - Disk space check completed.\" >> \"$LOG_FILE\"\n\n# Error handling: Check if df command failed\nif [ $? -ne 0 ]; then\n  echo \"$(date) - ERROR: df command failed. Please check the system.\" >> \"$LOG_FILE\"\n  exit 1\nfi\n\nexit 0\n\n# To run this script in the background, you can use either '&' or 'nohup'.\n# Using '&':\n#   ./disk_space_monitor.sh &\n# This will run the script in the background.  However, if you close the terminal, the script will be terminated.\n\n# Using 'nohup':\n#   nohup ./disk_space_monitor.sh > /dev/null 2>&1 &\n# This is the recommended approach. 'nohup' ensures that the script continues to run even after you close the terminal.\n# The '> /dev/null 2>&1' redirects both standard output and standard error to /dev/null, so you won't see any output in the terminal.\n\n# To schedule this script to run periodically, you can use 'cron'.\n# To edit the cron table, run 'crontab -e'.  Add a line like this to run the script every 10 minutes:\n# */10 * * * * /path/to/disk_space_monitor.sh\n\n\n# Make sure the script is executable:\n# chmod +x disk_space_monitor.sh"
        },
        "cost": 0.001345275,
        "input_tokens": 6802.5,
        "output_tokens": 541.5,
        "total_tokens": 7344.0,
        "execution_result": {
          "status": "success",
          "session_id": "54592742",
          "operations": [
            "direct_files"
          ],
          "created_files": [
            "media\\generated\\54592742\\disk_space_monitor.sh"
          ],
          "file_results": {
            "created_files": [
              "media\\generated\\54592742\\disk_space_monitor.sh"
            ],
            "file_count": 1,
            "total_size": 2291,
            "status": "success",
            "errors": [],
            "execution_time": 0.006456299917772412
          },
          "code_results": {},
          "total_time": 0.011182499816641212,
          "error": null
        },
        "created_files": [
          "media\\generated\\54592742\\disk_space_monitor.sh"
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-08-07T18:58:09.188985",
      "end_time": "2025-08-07T18:58:48.206659",
      "execution_time": 39.017674,
      "execution_result": {
        "status": "success",
        "session_id": "54592742",
        "operations": [
          "direct_files"
        ],
        "created_files": [
          "media\\generated\\54592742\\disk_space_monitor.sh"
        ],
        "file_results": {
          "created_files": [
            "media\\generated\\54592742\\disk_space_monitor.sh"
          ],
          "file_count": 1,
          "total_size": 2291,
          "status": "success",
          "errors": [],
          "execution_time": 0.006456299917772412
        },
        "code_results": {},
        "total_time": 0.011182499816641212,
        "error": null
      },
      "input_tokens": 0,
      "output_tokens": 0
    },
    {
      "id": "T007",
      "description": "Format the explanations and code examples for DAGs, SQL RIGHT JOIN, and disk space monitoring into a comprehensive HTML report with clear sections and syntax highlighting. Include the outputs from T001, T002, T003, T004, T005, and T006.",
      "agent": "FormatterAgent",
      "agent_prompt": "Format the explanations and code examples for DAGs, SQL RIGHT JOIN, and disk space monitoring into a comprehensive HTML report with clear sections and syntax highlighting. Include the outputs from T001, T002, T003, T004, T005, and T006. The report should have a title, introduction, a section for each topic (DAGs, SQL RIGHT JOIN, Disk Space Monitoring), and a conclusion. Each section should include the explanation and the corresponding code example. Ensure proper syntax highlighting for the code examples. Focus on readability and visual appeal.",
      "reads": [
        "T001",
        "T002",
        "T003",
        "T004",
        "T005",
        "T006"
      ],
      "writes": [
        "T007"
      ],
      "status": "completed",
      "output": {
        "initial_thoughts": "The previous output created a good foundation for the report. Now I will expand the report by adding more details to each section, including additional information about applications of DAGs, potential issues with RIGHT JOINs, and advanced features of the disk space monitoring script. I will also add a section on error handling and logging for each topic. I will integrate additional images found in the data and set call_self to true to further deepen the analysis.",
        "output": {
          "final_format": "html",
          "images": [
            {
              "url": "https://i.sstatic.net/qaIWj.png",
              "alt_text": "example DAG"
            },
            {
              "url": "https://www.programiz.com/sites/tutorial2program/files/right-join-in-sql.png",
              "alt_text": "How to use RIGHT JOIN in SQL"
            },
            {
              "url": "https://www.mysqltutorial.org/wp-content/uploads/2019/08/MySQL-RIGHT-JOIN-example.png",
              "alt_text": "MySQL RIGHT JOIN example"
            },
            {
              "url": "https://www.2daygeek.com/wp-content/uploads/2024/12/how-to-create-users-using-shell-script-in-linux-348x215.png",
              "alt_text": "How to Create Users using Shell Script in Linux"
            },
            {
              "url": "https://media.geeksforgeeks.org/wp-content/uploads/20231019170926/dag6-660x478.jpeg",
              "alt_text": "dag6-660x478"
            },
            {
              "url": "https://media.geeksforgeeks.org/wp-content/uploads/20250607125936039070/Student_table.webp",
              "alt_text": "Student_table"
            }
          ],
          "fallback_markdown": "# Comprehensive Technical Report\n\n## Introduction\n\nThis report provides explanations and code examples for DAGs, SQL RIGHT JOIN, and disk space monitoring.\n\n## DAGs (Directed Acyclic Graphs) in Python\n\nExplanation...\n\nCode Example:\n\n```python\n# Code here\n```\n\n## SQL RIGHT JOIN\n\nExplanation...\n\nCode Example:\n\n```sql\n-- SQL code here\n```\n\n## Bash Script for Disk Space Monitoring\n\nExplanation...\n\nCode Example:\n\n```bash\n#!/bin/bash\n# Bash script here\n```\n\n## Conclusion\n\nThis report concludes the explanations and code examples for the specified topics.",
          "reasoning": "I have expanded the comprehensive HTML report based on the provided data. The report now includes additional details and examples for DAGs, SQL RIGHT JOIN, and disk space monitoring. Each section has been enhanced with more context, potential issues, and error handling strategies.  More images were added to the report. `call_self` is set to true for a third pass.",
          "formatted_report_T007": "<div class='report'><h1 id='report-title'> Comprehensive Technical Report</h1><div id='introduction'><h2> Introduction</h2><p>This report provides in-depth explanations and practical code examples for three essential technical topics: Directed Acyclic Graphs (DAGs) in Python, SQL RIGHT JOIN operations for data retrieval, and Bash scripts for automated disk space monitoring. Each section delivers a detailed exploration of the core concepts, supported by hands-on code examples to illustrate effective implementation. This document is designed to provide actionable insights for developers, data engineers, and system administrators seeking to enhance their capabilities in these areas.</p></div><div id='dags'><h2 id='dags-title'> Directed Acyclic Graphs (DAGs) in Python</h2><p>A Directed Acyclic Graph (DAG) is a graph consisting of vertices and directed edges, with no cycles. DAGs are widely used to model dependencies and workflows, making them essential in various domains, including data science, data engineering, and task scheduling. Popular projects like Apache Airflow and Apache Spark heavily rely on DAGs to manage complex data pipelines and task orchestrations. <i>DAGs provide a structured and intuitive way to represent relationships and dependencies between tasks or processes.</i></p><img src='https://i.sstatic.net/qaIWj.png' alt='example DAG' style='max-width: 400px; margin: 10px 0;'><p>The fundamental concept behind a DAG is that tasks or nodes are connected by directed edges, indicating the order in which they must be executed. For instance, if task B depends on task A, task A must complete successfully before task B can start. The 'acyclic' property ensures that there are no circular dependencies, preventing infinite loops and guaranteeing a clear and deterministic execution path. DAGs are particularly useful in scenarios where the order of operations is critical for achieving the desired outcome. <a href='https://www.mungingdata.com/python/dag-directed-acyclic-graph-networkx/' target='_blank' rel='noopener noreferrer'>[1]</a></p><p><b>Applications of DAGs:</b></p><ul><li><b>Data Pipelines:</b> DAGs are used to define and manage complex data transformation pipelines, ensuring data flows correctly from source to destination.</li><li><b>Task Scheduling:</b> DAGs help schedule tasks in a way that respects dependencies, optimizing resource utilization and minimizing execution time.</li><li><b>Dependency Resolution:</b> DAGs are used to resolve dependencies in software projects, ensuring that libraries and modules are loaded in the correct order.</li><li><b>Causal Inference:</b> DAGs are applied in causal inference to model cause-and-effect relationships between variables.</li></ul><h3>Python Code Example:</h3><p>This example demonstrates how to create and manipulate a DAG using the <code>graphlib</code> module in Python. The code includes functionalities for adding nodes, edges, and performing a topological sort. The <code>graphlib</code> module is part of the Python standard library, making it a convenient choice for working with DAGs. </p><pre><code class='language-python'>import graphlib\n\nclass DAG:\n    def __init__(self):\n        self.graph = {}\n\n    def add_node(self, node):\n        if node not in self.graph:\n            self.graph[node] = set()\n\n    def add_edge(self, from_node, to_node):\n        if from_node not in self.graph:\n            self.add_node(from_node)\n        if to_node not in self.graph:\n            self.add_node(to_node)\n        self.graph[to_node].add(from_node)\n\n    def topological_sort(self):\n        try:\n            ts = graphlib.TopologicalSorter(self.graph)\n            return list(ts.static_order())\n        except graphlib.CycleError as e:\n            raise ValueError(\"Cycle detected in the DAG: Topological sort not possible.\") from e\n\ndag = DAG()\ndag.add_node(\"A\")\ndag.add_node(\"B\")\ndag.add_node(\"C\")\ndag.add_node(\"D\")\ndag.add_node(\"E\")\n\ndag.add_edge(\"A\", \"B\")\ndag.add_edge(\"A\", \"C\")\ndag.add_edge(\"B\", \"D\")\ndag.add_edge(\"C\", ",
          "E": "n\ntry:\n    sorted_nodes = dag.topological_sort()\n    print(",
          "Order": ", sorted_nodes)\nexcept ValueError as e:\n    print(f",
          "Error": {
            "e}": "",
            "Handling": "",
            "debugging.</p><p><b>Logging": "",
            "src='https": ""
          },
          "^Filesystem|tmpfs|cdrom' | awk ": "print $5",
          " $6}' | while read -r usage mount_point; do\n    usage_percent=$(echo $usage | sed 's/%//g')\n\n    if [[ \"$usage_percent\" -ge \"$THRESHOLD_CRITICAL\" ]]; then\n      send_alert \"Critical": "mount_point",
          "$usage_percent\"\n    elif [[ \"$usage_percent\" -ge \"$THRESHOLD_WARNING\" ]]; then\n      send_alert \"Warning": "mount_point",
          "$usage_percent": "n    fi\n  done\n}\n\n# Main script logic\ncheck_disk_space\n\n# Log the execution\necho",
          "$LOG_FILE": "n  exit 1\nfi\n\nexit 0\n</code></pre><p><b>To run this script in the background</b>, use <code>nohup ./disk_space_monitor.sh > /dev/null 2>&1 &</code>. This ensures that the script continues to run even after you close the terminal.</p><p><b>To schedule this script to run periodically</b>, use <code>cron</code>. Add a line like <code>*/10 * * * * /path/to/disk_space_monitor.sh</code> to run the script every 10 minutes.</p><p><b>Error Handling:</b></p><p>The script includes error handling to check if the <code>df</code> command failed. If the <code>df</code> command fails, the script logs an error message and exits. This prevents the script from continuing to run with invalid data.</p><p><b>Logging:</b></p><p>The script logs all activities to a log file, providing a history of disk space monitoring. The log file includes the date, time, and any alerts that were sent. This can be useful for tracking disk space usage over time and diagnosing issues.</p></div><div id='conclusion'><h2 id='conclusion-title'> Conclusion</h2><p>This report provided comprehensive explanations and practical code examples for Directed Acyclic Graphs (DAGs) in Python, SQL RIGHT JOIN operations, and Bash scripts for automated disk space monitoring. Understanding and implementing these concepts can significantly enhance workflow management, data retrieval, and system administration capabilities. The report also highlighted potential issues, error handling strategies, and advanced features to ensure robust and reliable implementations.</p></div><div id='source-citations'><h2 id='source-citations-title'> Source Citations</h2><ol><li><a href='https://www.mungingdata.com/python/dag-directed-acyclic-graph-networkx/' target='_blank' rel='noopener noreferrer'>Building DAGs / Directed Acyclic Graphs with Python - MungingData</a></li><li><a href='https://www.mysqltutorial.org/mysql-basics/mysql-right-join/' target='_blank' rel='noopener noreferrer'>MySQL RIGHT JOIN Explained By Practical Examples</a></li><li><a href='https://www.cyberciti.biz/tips/shell-script-to-watch-the-disk-space.html' target='_blank' rel='noopener noreferrer'>Shell Script to Watch the Disk Space - Cyberciti</a></li></ol></div></div>",
          "ERROR": "df command failed. Please check the system."
        },
        "call_self": false,
        "cost": 0.0044757,
        "input_tokens": 17952.0,
        "output_tokens": 2971.5,
        "total_tokens": 20923.5
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-08-07T18:58:48.226093",
      "end_time": "2025-08-07T19:00:43.256335",
      "execution_time": 115.030242,
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "initial_thoughts": "Okay, I need to create a comprehensive HTML report that includes explanations and code examples for DAGs, SQL RIGHT JOIN, and disk space monitoring. I will use the data from T001, T002, T003, T004, T005, and T006. I will organize the report into sections with proper headings and syntax highlighting for code examples. I will also include a brief introduction and conclusion. I will integrate images found in the data.",
            "output": {
              "final_format": "html",
              "images": [
                {
                  "url": "https://i.sstatic.net/qaIWj.png",
                  "alt_text": "example DAG"
                },
                {
                  "url": "https://www.programiz.com/sites/tutorial2program/files/right-join-in-sql.png",
                  "alt_text": "How to use RIGHT JOIN in SQL"
                },
                {
                  "url": "https://www.mysqltutorial.org/wp-content/uploads/2019/08/MySQL-RIGHT-JOIN-example.png",
                  "alt_text": "MySQL RIGHT JOIN example"
                },
                {
                  "url": "https://www.2daygeek.com/wp-content/uploads/2024/12/how-to-create-users-using-shell-script-in-linux-348x215.png",
                  "alt_text": "How to Create Users using Shell Script in Linux"
                },
                {
                  "url": "https://media.geeksforgeeks.org/wp-content/uploads/20231019170926/dag6-660x478.jpeg",
                  "alt_text": "dag6-660x478"
                }
              ],
              "fallback_markdown": "# Comprehensive Report\n\n## Introduction\n\nThis report provides explanations and code examples for DAGs, SQL RIGHT JOIN, and disk space monitoring.\n\n## DAGs (Directed Acyclic Graphs) in Python\n\nExplanation...\n\nCode Example:\n\n```python\n# Code here\n```\n\n## SQL RIGHT JOIN\n\nExplanation...\n\nCode Example:\n\n```sql\n-- SQL code here\n```\n\n## Bash Script for Disk Space Monitoring\n\nExplanation...\n\nCode Example:\n\n```bash\n#!/bin/bash\n# Bash script here\n```\n\n## Conclusion\n\nThis report concludes the explanations and code examples for the specified topics.",
              "reasoning": "I have generated a comprehensive HTML report based on the provided data. The report includes explanations and code examples for DAGs, SQL RIGHT JOIN, and disk space monitoring. Each section contains a brief explanation and the corresponding code example with syntax highlighting. I have also included an introduction and conclusion to provide context and closure to the report. Images were added to the report.",
              "formatted_report_T007": "<div class='report'><h1 id='report-title'>Comprehensive Technical Report</h1><div id='introduction'><h2>Introduction</h2><p>This report provides explanations and code examples for three key technical topics: Directed Acyclic Graphs (DAGs) in Python, SQL RIGHT JOIN operations, and Bash scripts for automated disk space monitoring. Each section includes a detailed explanation of the concept, followed by a practical code example to illustrate its implementation.</p></div><div id='dags'><h2 id='dags-title'>Directed Acyclic Graphs (DAGs) in Python</h2><p>A Directed Acyclic Graph (DAG) is a graph that consists of vertices and directed edges, with no cycles. DAGs are commonly used to model dependencies and workflows, making them essential in data science, data engineering, and task scheduling. They are used in Apache Airflow and Apache Spark. <i>DAGs provide a clear, organized way to represent relationships and dependencies.</i></p><img src='https://i.sstatic.net/qaIWj.png' alt='example DAG' style='max-width: 400px; margin: 10px 0;'><p>The core concept is that tasks or nodes are connected by directed edges, representing the order in which they must be executed. For example, task B depends on task A, meaning A must complete before B can start. The 'acyclic' property ensures that there are no circular dependencies, preventing infinite loops and ensuring a clear execution path.</p><h3>Python Code Example:</h3><p>This example demonstrates how to create and manipulate a DAG using the <code>graphlib</code> module in Python. The code includes functionalities for adding nodes, edges, and performing a topological sort.</p><pre><code class='language-python'>import graphlib\n\nclass DAG:\n    def __init__(self):\n        self.graph = {}\n\n    def add_node(self, node):\n        if node not in self.graph:\n            self.graph[node] = set()\n\n    def add_edge(self, from_node, to_node):\n        if from_node not in self.graph:\n            self.add_node(from_node)\n        if to_node not in self.graph:\n            self.add_node(to_node)\n        self.graph[to_node].add(from_node)\n\n    def topological_sort(self):\n        try:\n            ts = graphlib.TopologicalSorter(self.graph)\n            return list(ts.static_order())\n        except graphlib.CycleError as e:\n            raise ValueError(\"Cycle detected in the DAG: Topological sort not possible.\") from e\n\ndag = DAG()\ndag.add_node(\"A\")\ndag.add_node(\"B\")\ndag.add_node(\"C\")\ndag.add_node(\"D\")\ndag.add_node(\"E\")\n\ndag.add_edge(\"A\", \"B\")\ndag.add_edge(\"A\", \"C\")\ndag.add_edge(\"B\", \"D\")\ndag.add_edge(\"C\", \"E\")\n\ntry:\n    sorted_nodes = dag.topological_sort()\n    print(\"Topological Sort Order:\", sorted_nodes)\nexcept ValueError as e:\n    print(f\"Error: {e}\")</code></pre></div><div id='sql-right-join'><h2 id='sql-right-join-title'>SQL RIGHT JOIN</h2><p>The SQL RIGHT JOIN statement is used to combine rows from two tables based on a related column. It ensures that all rows from the right table are included in the result, along with matching rows from the left table. If there is no matching row in the left table, NULL values are returned for the left table's columns.</p><img src='https://www.programiz.com/sites/tutorial2program/files/right-join-in-sql.png' alt='How to use RIGHT JOIN in SQL' style='max-width: 400px; margin: 10px 0;'><img src='https://www.mysqltutorial.org/wp-content/uploads/2019/08/MySQL-RIGHT-JOIN-example.png' alt='MySQL RIGHT JOIN example' style='max-width: 400px; margin: 10px 0;'><p>This join is particularly useful when you want to retrieve all records from one table (the right table) and only the matching records from a related table (the left table). Common use cases include displaying all items, handling missing data, and scenarios where relationships between tables are optional. <b>RIGHT JOIN</b> can be useful to check for possible data integrity problems, as any mismatch between tables might highlight missing entries</p><h3>SQL Code Example:</h3><p>This example demonstrates a RIGHT JOIN between 'employees' and 'departments' tables, highlighting its use in identifying departments without employees.</p><pre><code class='language-sql'>-- SQL query to demonstrate RIGHT JOIN\n-- This query identifies departments that have no employees.\n\n-- Sample tables (you can create these in your SQL environment)\n-- Table: employees\n-- Columns: employee_id (INT, PRIMARY KEY), employee_name (VARCHAR), department_id (INT, FOREIGN KEY referencing departments.department_id)\n\n-- Table: departments\n-- Columns: department_id (INT, PRIMARY KEY), department_name (VARCHAR)\n\nSELECT\n    d.department_name,\n    COUNT(e.employee_id) AS employee_count\nFROM\n    departments d\nRIGHT JOIN\n    employees e ON d.department_id = e.department_id\nGROUP BY\n    d.department_name\nHAVING\n    COUNT(e.employee_id) = 0;\n\n-- Explanation:\n-- 1. The RIGHT JOIN ensures that all departments are included in the result, even if they don't have any employees.\n-- 2. The ON clause specifies the join condition: matching department_id in both tables.\n-- 3. COUNT(e.employee_id) counts the number of employees in each department. If a department has no employees, this count will be 0.\n-- 4. GROUP BY d.department_name groups the results by department name to allow for the count.\n-- 5. HAVING COUNT(e.employee_id) = 0 filters the results to only show departments with no employees.</code></pre></div><div id='disk-space-monitoring'><h2 id='disk-space-monitoring-title'>Bash Script for Disk Space Monitoring</h2><p>Automating disk space monitoring using a Bash script is crucial for system administrators to prevent system crashes and data loss due to insufficient disk space. The script checks disk space usage, compares it against predefined thresholds, and sends alerts when these thresholds are exceeded. <i>The early warning system helps in proactive management of storage resources.</i></p><img src='https://www.2daygeek.com/wp-content/uploads/2024/12/how-to-create-users-using-shell-script-in-linux-348x215.png' alt='How to Create Users using Shell Script in Linux' style='max-width: 400px; margin: 10px 0;'><p>Key benefits include early detection of potential storage bottlenecks, improved system performance through optimized storage allocation, and reduced downtime by preventing disk space exhaustion.</p><h3>Bash Script Example:</h3><p>This script monitors disk space usage and sends alerts when warning or critical thresholds are exceeded. Configuration options are included for thresholds, recipient email, and log file location.</p><pre><code class='language-bash'>#!/bin/bash\n\n# Description: This script monitors disk space usage and sends alerts when thresholds are exceeded.\n# Author: CoderAgent\n# Date: October 26, 2023\n\n# Configuration section\nTHRESHOLD_WARNING=80  # Warning threshold (percentage)\nTHRESHOLD_CRITICAL=95 # Critical threshold (percentage)\nRECIPIENT_EMAIL=\"[email protected]\" # Email address to send alerts to\nLOG_FILE=\"/var/log/disk_space_monitor.log\" # Log file location\n\n# Function to send email alert\nsend_alert() {\n  SUBJECT=\"Disk Space Alert: $(hostname) - $1\"\n  BODY=\"Disk: $2\\nUsage: $3%\\nThreshold: $1\"\n  echo \"$BODY\" | mail -s \"$SUBJECT\" \"$RECIPIENT_EMAIL\"\n  echo \"$(date) - ALERT: $SUBJECT - $BODY\" >> \"$LOG_FILE\"\n}\n\n# Function to check disk space\ncheck_disk_space() {\n  df -h | grep -vE '^Filesystem|tmpfs|cdrom' | awk '{print $5 \" \" $6}' | while read -r usage mount_point; do\n    usage_percent=$(echo $usage | sed 's/%//g')\n\n    if [[ \"$usage_percent\" -ge \"$THRESHOLD_CRITICAL\" ]]; then\n      send_alert \"Critical\" \"$mount_point\" \"$usage_percent\"\n    elif [[ \"$usage_percent\" -ge \"$THRESHOLD_WARNING\" ]]; then\n      send_alert \"Warning\" \"$mount_point\" \"$usage_percent\"\n    fi\n  done\n}\n\n# Main script logic\ncheck_disk_space\n\n# Log the execution\necho \"$(date) - Disk space check completed.\" >> \"$LOG_FILE\"\n\n# Error handling: Check if df command failed\nif [ $? -ne 0 ]; then\n  echo \"$(date) - ERROR: df command failed. Please check the system.\" >> \"$LOG_FILE\"\n  exit 1\nfi\n\nexit 0\n</code></pre><p><b>To run this script in the background</b>, use <code>nohup ./disk_space_monitor.sh > /dev/null 2>&1 &</code>.  This will ensure that the script continues to run even after you close the terminal.</p><p><b>To schedule this script to run periodically</b>, use <code>cron</code>.  Add a line like <code>*/10 * * * * /path/to/disk_space_monitor.sh</code> to run the script every 10 minutes.</p></div><div id='conclusion'><h2 id='conclusion-title'>Conclusion</h2><p>This report provided detailed explanations and practical code examples for Directed Acyclic Graphs (DAGs) in Python, SQL RIGHT JOIN operations, and Bash scripts for automated disk space monitoring. Understanding and implementing these concepts can significantly enhance workflow management, data retrieval, and system administration capabilities.</p></div></div>"
            },
            "call_self": true,
            "cost": 0.0035714249999999996,
            "input_tokens": 16183.5,
            "output_tokens": 1906.5,
            "total_tokens": 18090.0
          }
        },
        {
          "iteration": 2,
          "output": {
            "initial_thoughts": "The previous output created a good foundation for the report. Now I will expand the report by adding more details to each section, including additional information about applications of DAGs, potential issues with RIGHT JOINs, and advanced features of the disk space monitoring script. I will also add a section on error handling and logging for each topic. I will integrate additional images found in the data and set call_self to true to further deepen the analysis.",
            "output": {
              "final_format": "html",
              "images": [
                {
                  "url": "https://i.sstatic.net/qaIWj.png",
                  "alt_text": "example DAG"
                },
                {
                  "url": "https://www.programiz.com/sites/tutorial2program/files/right-join-in-sql.png",
                  "alt_text": "How to use RIGHT JOIN in SQL"
                },
                {
                  "url": "https://www.mysqltutorial.org/wp-content/uploads/2019/08/MySQL-RIGHT-JOIN-example.png",
                  "alt_text": "MySQL RIGHT JOIN example"
                },
                {
                  "url": "https://www.2daygeek.com/wp-content/uploads/2024/12/how-to-create-users-using-shell-script-in-linux-348x215.png",
                  "alt_text": "How to Create Users using Shell Script in Linux"
                },
                {
                  "url": "https://media.geeksforgeeks.org/wp-content/uploads/20231019170926/dag6-660x478.jpeg",
                  "alt_text": "dag6-660x478"
                },
                {
                  "url": "https://media.geeksforgeeks.org/wp-content/uploads/20250607125936039070/Student_table.webp",
                  "alt_text": "Student_table"
                }
              ],
              "fallback_markdown": "# Comprehensive Technical Report\n\n## Introduction\n\nThis report provides explanations and code examples for DAGs, SQL RIGHT JOIN, and disk space monitoring.\n\n## DAGs (Directed Acyclic Graphs) in Python\n\nExplanation...\n\nCode Example:\n\n```python\n# Code here\n```\n\n## SQL RIGHT JOIN\n\nExplanation...\n\nCode Example:\n\n```sql\n-- SQL code here\n```\n\n## Bash Script for Disk Space Monitoring\n\nExplanation...\n\nCode Example:\n\n```bash\n#!/bin/bash\n# Bash script here\n```\n\n## Conclusion\n\nThis report concludes the explanations and code examples for the specified topics.",
              "reasoning": "I have expanded the comprehensive HTML report based on the provided data. The report now includes additional details and examples for DAGs, SQL RIGHT JOIN, and disk space monitoring. Each section has been enhanced with more context, potential issues, and error handling strategies.  More images were added to the report. `call_self` is set to true for a third pass.",
              "formatted_report_T007": "<div class='report'><h1 id='report-title'> Comprehensive Technical Report</h1><div id='introduction'><h2> Introduction</h2><p>This report provides in-depth explanations and practical code examples for three essential technical topics: Directed Acyclic Graphs (DAGs) in Python, SQL RIGHT JOIN operations for data retrieval, and Bash scripts for automated disk space monitoring. Each section delivers a detailed exploration of the core concepts, supported by hands-on code examples to illustrate effective implementation. This document is designed to provide actionable insights for developers, data engineers, and system administrators seeking to enhance their capabilities in these areas.</p></div><div id='dags'><h2 id='dags-title'> Directed Acyclic Graphs (DAGs) in Python</h2><p>A Directed Acyclic Graph (DAG) is a graph consisting of vertices and directed edges, with no cycles. DAGs are widely used to model dependencies and workflows, making them essential in various domains, including data science, data engineering, and task scheduling. Popular projects like Apache Airflow and Apache Spark heavily rely on DAGs to manage complex data pipelines and task orchestrations. <i>DAGs provide a structured and intuitive way to represent relationships and dependencies between tasks or processes.</i></p><img src='https://i.sstatic.net/qaIWj.png' alt='example DAG' style='max-width: 400px; margin: 10px 0;'><p>The fundamental concept behind a DAG is that tasks or nodes are connected by directed edges, indicating the order in which they must be executed. For instance, if task B depends on task A, task A must complete successfully before task B can start. The 'acyclic' property ensures that there are no circular dependencies, preventing infinite loops and guaranteeing a clear and deterministic execution path. DAGs are particularly useful in scenarios where the order of operations is critical for achieving the desired outcome. <a href='https://www.mungingdata.com/python/dag-directed-acyclic-graph-networkx/' target='_blank' rel='noopener noreferrer'>[1]</a></p><p><b>Applications of DAGs:</b></p><ul><li><b>Data Pipelines:</b> DAGs are used to define and manage complex data transformation pipelines, ensuring data flows correctly from source to destination.</li><li><b>Task Scheduling:</b> DAGs help schedule tasks in a way that respects dependencies, optimizing resource utilization and minimizing execution time.</li><li><b>Dependency Resolution:</b> DAGs are used to resolve dependencies in software projects, ensuring that libraries and modules are loaded in the correct order.</li><li><b>Causal Inference:</b> DAGs are applied in causal inference to model cause-and-effect relationships between variables.</li></ul><h3>Python Code Example:</h3><p>This example demonstrates how to create and manipulate a DAG using the <code>graphlib</code> module in Python. The code includes functionalities for adding nodes, edges, and performing a topological sort. The <code>graphlib</code> module is part of the Python standard library, making it a convenient choice for working with DAGs. </p><pre><code class='language-python'>import graphlib\n\nclass DAG:\n    def __init__(self):\n        self.graph = {}\n\n    def add_node(self, node):\n        if node not in self.graph:\n            self.graph[node] = set()\n\n    def add_edge(self, from_node, to_node):\n        if from_node not in self.graph:\n            self.add_node(from_node)\n        if to_node not in self.graph:\n            self.add_node(to_node)\n        self.graph[to_node].add(from_node)\n\n    def topological_sort(self):\n        try:\n            ts = graphlib.TopologicalSorter(self.graph)\n            return list(ts.static_order())\n        except graphlib.CycleError as e:\n            raise ValueError(\"Cycle detected in the DAG: Topological sort not possible.\") from e\n\ndag = DAG()\ndag.add_node(\"A\")\ndag.add_node(\"B\")\ndag.add_node(\"C\")\ndag.add_node(\"D\")\ndag.add_node(\"E\")\n\ndag.add_edge(\"A\", \"B\")\ndag.add_edge(\"A\", \"C\")\ndag.add_edge(\"B\", \"D\")\ndag.add_edge(\"C\", ",
              "E": "n\ntry:\n    sorted_nodes = dag.topological_sort()\n    print(",
              "Order": ", sorted_nodes)\nexcept ValueError as e:\n    print(f",
              "Error": {
                "e}": "",
                "Handling": "",
                "debugging.</p><p><b>Logging": "",
                "src='https": ""
              },
              "^Filesystem|tmpfs|cdrom' | awk ": "print $5",
              " $6}' | while read -r usage mount_point; do\n    usage_percent=$(echo $usage | sed 's/%//g')\n\n    if [[ \"$usage_percent\" -ge \"$THRESHOLD_CRITICAL\" ]]; then\n      send_alert \"Critical": "mount_point",
              "$usage_percent\"\n    elif [[ \"$usage_percent\" -ge \"$THRESHOLD_WARNING\" ]]; then\n      send_alert \"Warning": "mount_point",
              "$usage_percent": "n    fi\n  done\n}\n\n# Main script logic\ncheck_disk_space\n\n# Log the execution\necho",
              "$LOG_FILE": "n  exit 1\nfi\n\nexit 0\n</code></pre><p><b>To run this script in the background</b>, use <code>nohup ./disk_space_monitor.sh > /dev/null 2>&1 &</code>. This ensures that the script continues to run even after you close the terminal.</p><p><b>To schedule this script to run periodically</b>, use <code>cron</code>. Add a line like <code>*/10 * * * * /path/to/disk_space_monitor.sh</code> to run the script every 10 minutes.</p><p><b>Error Handling:</b></p><p>The script includes error handling to check if the <code>df</code> command failed. If the <code>df</code> command fails, the script logs an error message and exits. This prevents the script from continuing to run with invalid data.</p><p><b>Logging:</b></p><p>The script logs all activities to a log file, providing a history of disk space monitoring. The log file includes the date, time, and any alerts that were sent. This can be useful for tracking disk space usage over time and diagnosing issues.</p></div><div id='conclusion'><h2 id='conclusion-title'> Conclusion</h2><p>This report provided comprehensive explanations and practical code examples for Directed Acyclic Graphs (DAGs) in Python, SQL RIGHT JOIN operations, and Bash scripts for automated disk space monitoring. Understanding and implementing these concepts can significantly enhance workflow management, data retrieval, and system administration capabilities. The report also highlighted potential issues, error handling strategies, and advanced features to ensure robust and reliable implementations.</p></div><div id='source-citations'><h2 id='source-citations-title'> Source Citations</h2><ol><li><a href='https://www.mungingdata.com/python/dag-directed-acyclic-graph-networkx/' target='_blank' rel='noopener noreferrer'>Building DAGs / Directed Acyclic Graphs with Python - MungingData</a></li><li><a href='https://www.mysqltutorial.org/mysql-basics/mysql-right-join/' target='_blank' rel='noopener noreferrer'>MySQL RIGHT JOIN Explained By Practical Examples</a></li><li><a href='https://www.cyberciti.biz/tips/shell-script-to-watch-the-disk-space.html' target='_blank' rel='noopener noreferrer'>Shell Script to Watch the Disk Space - Cyberciti</a></li></ol></div></div>",
              "ERROR": "df command failed. Please check the system."
            },
            "call_self": false,
            "cost": 0.0044757,
            "input_tokens": 17952.0,
            "output_tokens": 2971.5,
            "total_tokens": 20923.5
          }
        }
      ],
      "call_self_used": true,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "ROOT",
      "target": "T003"
    },
    {
      "source": "ROOT",
      "target": "T005"
    },
    {
      "source": "T001",
      "target": "T002"
    },
    {
      "source": "T002",
      "target": "T007"
    },
    {
      "source": "T003",
      "target": "T004"
    },
    {
      "source": "T004",
      "target": "T007"
    },
    {
      "source": "T005",
      "target": "T006"
    },
    {
      "source": "T006",
      "target": "T007"
    }
  ]
}